SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/*****************************************************
    MC9S12DP256.h - Target interface library
    Describes I/O registers of MC68HC12DP256
 ----------------------------------------------------
   Copyright (c) HIWARE AG, Basel, Switzerland
                  Do not modify!
 *****************************************************/

/****************************************************************************/
/*      The M68HC12DP256 MCU is equipped with several devices, which share  */
/*      the same architecture. There are 2 Analog to Digital converter      */
/*      (ATD0 and ATD1), 2 Serial Communication Interface (SCI0 and SCI1),  */
/*      3 Serial Peripheral Interface (SPI0, SPI1 and SPI2), 5 CAN module   */
/*      (CAN0, CAN1, CAN2, CAN3 and CAN4). The bits inside of the registers */
/*      for for two similar devices  share the same name. In order to be    */
/*      able to access the single bits in the diferent devices, a suffix    */
/*      has beenadded to the different bit mnemeonics.                      */
/*      _0 has been added to the bit mnemonics inside of ATD0, SCI0, SPI0   */
/*         and CAN0                                                         */
/*      _1 has been added to the bit mnemonics inside of ATD1, SCI1, SPI1   */
/*         and CAN1                                                         */
/*      _2 has been added to the bit mnemonics inside of SPI2 and CAN2      */
/*      _3 has been added to the bit mnemonics inside of CAN3               */
/*      _4 has been added to the bit mnemonics inside of CAN4               */
/*       Example TIE_0 refers to bit 7 in SCI0CR2 register                  */
/*               TIE_1 refers to bit 7 in SCI1CR2 register                  */
/****************************************************************************/


#ifndef __6812DP256_H__
#define __6812DP256_H__

#include <stdtypes.h>

#define _IO_BASE_ADDR 0
#define _IO_AT(x)  @(_IO_BASE_ADDR+(x))

#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */

/**************************************************************************************************/
/*                                         DEFINE PORT A                                          */
/**************************************************************************************************/
 volatile  unsigned char  PORTA   _IO_AT(0x00);  /* port A */

 volatile  unsigned char  DDRA     _IO_AT(0x02);  /* data direction port A */

/**************************************************************************************************/
/*                                         DEFINE PORT B                                          */
/**************************************************************************************************/
 volatile  unsigned char PORTB    _IO_AT(0x01);  /* port B */

 volatile  unsigned char DDRB     _IO_AT(0x03);  /* data direction port B */

/**************************************************************************************************/
/*                                         DEFINE PORT E                                          */
/**************************************************************************************************/

 volatile  unsigned char PORTE    _IO_AT(0x08);  /* port E */


/****Data Register E******/           
 volatile   union {                  
  struct {          
    unsigned char BIT0:1;
    unsigned char BIT1:1;
    unsigned char _DDRE2:1;
    unsigned char _DDRE3:1;
    unsigned char _DDRE4:1;
    unsigned char _DDRE5:1;
    unsigned char _DDRE6:1;
    unsigned char _DDRE7:1;
  } DDRE_BITS;        
  unsigned char DDRE_BYTE;  
}DDRE1  _IO_AT(0x09);         

/* DEFINE REGISTER */        
#define DDRE DDRE1.DDRE_BYTE

/*DEFINE REGISTER BITS*/
#define DDRE2 DDRE1.DDRE_BITS._DDRE2
#define DDRE3 DDRE1.DDRE_BITS._DDRE3
#define DDRE4 DDRE1.DDRE_BITS._DDRE4
#define DDRE5 DDRE1.DDRE_BITS._DDRE5
#define DDRE6 DDRE1.DDRE_BITS._DDRE6
#define DDRE7 DDRE1.DDRE_BITS._DDRE7

/**************************************************************************************************/
/*                               PORT E ASSIGNEMENT REGISTER                                      */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char BIT0:1;
    unsigned char BIT1:1;
    unsigned char _RDWE:1;
    unsigned char _LSTRE:1;
    unsigned char _NECLK:1;
    unsigned char _PIPOE:1;
    unsigned char BIT6:1;
    unsigned char _NOACCE:1;
  } PEAR_BITS;        
  unsigned char PEAR_BYTE;  
}PEAR1 _IO_AT(0x0a);       

/*DEFINE REGISTER*/
#define PEAR PEAR1.PEAR_BYTE

/*DEFINE REGISTER BITS*/
#define RDWE PEAR1.PEAR_BITS._RDWE
#define LSTRE PEAR1.PEAR_BITS._LSTRE
#define NECKL PEAR1.PEAR_BITS._NECLK
#define PIPOE PEAR1.PEAR_BITS._PIPOE
#define NOACCE PEAR1.PEAR_BITS._NOACCE

/**************************************************************************************************/
/*                                            MODE REGISTER                                       */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _EME:1     ;
    unsigned char _EMK:1    ;
    unsigned char BIT2:1  ;
    unsigned char _IVIS:1    ;
    unsigned char BIT4:1    ;
    unsigned char _MODA:1    ;
    unsigned char _MODB:1    ;
    unsigned char _MODC:1   ;
  } MODE_BITS;        
  unsigned char MODE_BYTE;  
}MODE1 _IO_AT(0x0B);       

/*DEFINE REGISTER*/
#define MODE MODE1.MODE_BYTE

/*DEFINE REGISTER BITS*/
#define EME MODE1.MODE_BITS._EME
#define EMK MODE1.MODE_BITS._EMK
#define IVIS MODE1.MODE_BITS._IVIS
#define MODA MODE1.MODE_BITS._MODA
#define MODB MODE1.MODE_BITS._MODB
#define MODC MODE1.MODE_BITS._MODC

/**************************************************************************************************/
/*                               PULL-UP CONTROL REGISTER                                         */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _PUPAE:1;
    unsigned char _PUPBE:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char _PUPEE:1;
    unsigned char BIT5:1;
    unsigned char BIT6:1;
    unsigned char _PUPKE:1;
  } PUCR_BITS;        
  unsigned char PUCR_BYTE;  
}PUCR1 _IO_AT(0x0C);       

/*DEFINE REGISTER*/
#define PUCR PUCR1.PUCR_BYTE

/*DEFINE REGISTER BITS*/
#define PUPAE PUCR1.PUCR_BITS._PUPAE
#define PUPBE PUCR1.PUCR_BITS._PUPBE
#define PUPEE PUCR1.PUCR_BITS._PUPEE
#define PUPKE PUCR1.PUCR_BITS._PUPKE

