SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                               REDUCED DRIVE OF I\O LINES                                       */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _RDPA:1;
    unsigned char _RDPB:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char _RDPE:1;
    unsigned char BIT5:1;
    unsigned char BIT6:1;
    unsigned char _RDPK:1;
  } RDRIV_BITS;        
  unsigned char RDRIV_BYTE;  
}RDRIV1 _IO_AT(0x0D);       

/*DEFINE REGISTER*/
#define RDRIV RDRIV1.RDRIV_BYTE

/*DEFINE REGISTER BITS*/
#define RDPA RDRIV1.RDRIV_BITS._RDPA
#define RDPB RDRIV1.RDRIV_BITS._RDPB
#define RDPE RDRIV1.RDRIV_BITS._RDPE
#define RDPK RDRIV1.RDRIV_BITS._RDPK

/**************************************************************************************************/
/*                              EXTERNAL BUS INTERFACE CONTROL                                    */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _ESTR:1;
    unsigned char BIT1:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char BIT4:1;
    unsigned char BIT5:1;
    unsigned char BIT6:1;
    unsigned char BIT7:1;
  } EBICTL_BITS;        
  unsigned char EBICTL_BYTE;  
}EBICTL1 _IO_AT(0x0E);       

/*DEFINE REGISTER*/
#define EBICTL EBICTL1.EBICTL_BYTE

/*DEFINE REGISTER BITS*/
#define ESTR EBICTL1.EBICTL_BITS._ESTR

/**************************************************************************************************/
/*                    INITIALIZATION OF INTERNAL RAM POSITION REGISTER                            */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _RAMHAL:1;
    unsigned char BIT1:1;
    unsigned char BIT2:1;
    unsigned char _RAM11:1;
    unsigned char _RAM12:1;
    unsigned char _RAM13:1;
    unsigned char _RAM14:1;
    unsigned char _RAM15:1;
  } INITRM_BITS;        
  unsigned char INITRM_BYTE;  
}INITRM1 _IO_AT(0x10);       

/*DEFINE REGISTER*/
#define INITRM INITRM1.INITRM_BYTE

/*DEFINE REGISTER BITS*/
#define RAMHAL INITRM1.INITRM_BITS._RAMHAL
#define RAM11  INITRM1.INITRM_BITS._RAM11
#define RAM12  INITRM1.INITRM_BITS._RAM12
#define RAM13  INITRM1.INITRM_BITS._RAM13
#define RAM14  INITRM1.INITRM_BITS._RAM14
#define RAM15  INITRM1.INITRM_BITS._RAM15

/**************************************************************************************************/
/*                    INITIALIZATION OF INTERNAL REGISTER POSITION REGISTER                       */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char BIT0:1;
    unsigned char BIT1:1;
    unsigned char BIT2:1;
    unsigned char _REG11:1;
    unsigned char _REG12:1;
    unsigned char _REG13:1;
    unsigned char _REG14:1;
    unsigned char _REG15:1;
  } INITRG_BITS;        
  unsigned char INITRG_BYTE;  
}INITRG1 _IO_AT(0x11);       

/*DEFINE REGISTER*/
#define INITRG INITRG1.INITRG_BYTE

/*DEFINE REGISTER BITS*/
#define REG11 INITRG1.INITRG_BITS._REG11
#define REG12 INITRG1.INITRG_BITS._REG12
#define REG13 INITRG1.INITRG_BITS._REG13
#define REG14 INITRG1.INITRG_BITS._REG14
#define REG15 INITRG1.INITRG_BITS._REG15

/**************************************************************************************************/
/*                    INITIALIZATION OF INTERNAL EEPROM POSITION REGISTER                         */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _EEON:1;
    unsigned char BIT1:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char _EE12:1;
    unsigned char _EE13:1;
    unsigned char _EE14:1;
    unsigned char _EE15:1;
  } INITEE_BITS;        
  unsigned char INITEE_BYTE;  
}INITEE1 _IO_AT(0x12);       

/*DEFINE REGISTER*/
#define INITEE INITEE1.INITEE_BYTE

/*DEFINE REGISTER BITS*/
#define EEON INITEE1.INITEE_BITS._EEON
#define EE12 INITEE1.INITEE_BITS._EE12
#define EE13 INITEE1.INITEE_BITS._EE13
#define EE14 INITEE1.INITEE_BITS._EE14
#define EE15 INITEE1.INITEE_BITS._EE15

/**************************************************************************************************/
/*                         MISCELLANEOUS MAPPING CONTROL REGISTER                                 */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _ROMON:1;
    unsigned char _ROMHM:1;
    unsigned char _EXSTR0:1;
    unsigned char _EXSTR1:1;
    unsigned char BIT4:1;
    unsigned char BIT5:1;
    unsigned char BIT6:1;
    unsigned char BIT7:1;
  } MISC_BITS;        
  unsigned char MISC_BYTE;  
}MISC1 _IO_AT(0x13);       

/*DEFINE REGISTER*/
#define MISC MISC1.MISC_BYTE

/*DEFINE REGISTER BITS*/
#define ROMON MISC1.MISC_BITS._ROMON
#define ROMHM MISC1.MISC_BITS._ROMHM
#define EXSTR0 MISC1.MISC_BITS._EXSTR0
#define EXSTR1 MISC1.MISC_BITS._EXSTR1

/**************************************************************************************************/
/*                                     MAPPING TEST REGISTERS                                     */
/**************************************************************************************************/
 volatile  unsigned char  MTST0   _IO_AT(0x14); 
 volatile  unsigned char  MTST1   _IO_AT(0x17); 


/**************************************************************************************************/
/*                             INTERRUPT TEST CONTROL REGISTER                                    */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _ADR:4;
    unsigned char _WRTINT:1;
    unsigned char BIT5:1;
    unsigned char BIT6:1;
    unsigned char BIT7:1;
  } ITCR_BITS;        
  unsigned char ITCR_BYTE;  
}ITCR1 _IO_AT(0x15);       

/*DEFINE REGISTER*/
#define ITCR ITCR1.ITCR_BYTE

/*DEFINE REGISTER BITS*/
#define ADR ITCR1.ITCR_BITS._ADR
#define WRTINT ITCR1.ITCR_BITS._WRTINT

