SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                INTERRUPT TEST  REGISTER                                        */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _INT0:1;
    unsigned char _INT2:1;
    unsigned char _INT4:1;
    unsigned char _INT6:1;
    unsigned char _INT8:1;
    unsigned char _INTA:1;
    unsigned char _INTC:1;
    unsigned char _INTE:1;
  } ITEST_BITS;        
  unsigned char ITEST_BYTE;  
}ITEST1 _IO_AT(0x16);       

/*DEFINE REGISTER*/
#define ITEST ITEST1.ITEST_BYTE

/*DEFINE REGISTER BITS*/
#define INT0 ITEST1.ITEST_BITS._INT0
#define INT2 ITEST1.ITEST_BITS._INT2
#define INT4 ITEST1.ITEST_BITS._INT4
#define INT6 ITEST1.ITEST_BITS._INT6
#define INT8 ITEST1.ITEST_BITS._INT8
#define INTA ITEST1.ITEST_BITS._INTA
#define INTC ITEST1.ITEST_BITS._INTC
#define INTE ITEST1.ITEST_BITS._INTE

/**************************************************************************************************/
/*                              PART ID  REGISTER ASSIGNMENTS                                     */
/**************************************************************************************************/
 volatile  union {                  
  struct {
    unsigned char _PARTIDH;          
    unsigned char _PARTIDL;          
  } PARTID_BYTES;        
  unsigned int PARTID_WORD;  
}PARTID1 _IO_AT(0x1A);       

/*DEFINE REGISTER*/
#define PARTID PARTID1.PARTID_WORD

/*DEFINE REGISTER BYTES*/
#define PARTIDH PARTID1.PARTID_BYTES._PARTIDH
#define PARTIDL PARTID1.PARTID_BYTES._PARTIDL

/**************************************************************************************************/
/*                                                                        */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _ram_sw0:1;
    unsigned char _ram_sw1:1;
    unsigned char _ram_sw2:1;
    unsigned char BIT3:1;
    unsigned char _eep_sw0:1;
    unsigned char _eep_sw1:1;
    unsigned char BIT6:1;
    unsigned char _reg_sw0:1;
  } MEMSIZ0_BITS;        
  unsigned char MEMSIZ0_BYTE;  
}MEMSIZ01 _IO_AT(0x1C);       

/*DEFINE REGISTER*/
#define MEMSIZ0 MEMSIZ01.MEMSIZ0_BYTE

/*DEFINE REGISTER BITS*/
#define ram_sw0 MEMSIZ01.MEMSIZ0_BITS._ram_sw0
#define ram_sw1 MEMSIZ01.MEMSIZ0_BITS._ram_sw1
#define ram_sw2 MEMSIZ01.MEMSIZ0_BITS._ram_sw2
#define eep_sw0 MEMSIZ01.MEMSIZ0_BITS._eep_sw0
#define eep_sw1 MEMSIZ01.MEMSIZ0_BITS._eep_sw1
#define reg_sw0 MEMSIZ01.MEMSIZ0_BITS._reg_sw0

/**************************************************************************************************/
/*                                                                        */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _pag_sw0:1;
    unsigned char _pag_sw1:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char BIT4:1;
    unsigned char BIT5:1;
    unsigned char _rom_sw0:1;
    unsigned char _rom_sw1:1;
  } MEMSIZ1_BITS;        
  unsigned char MEMSIZ1_BYTE;  
}MEMSIZ11 _IO_AT(0x1D);       

/*DEFINE REGISTER*/
#define MEMSIZ1 MEMSIZ11.MEMSIZ1_BYTE

/*DEFINE REGISTER BITS*/
#define pag_sw0 MEMSIZ11.MEMSIZ1_BITS._pag_sw0
#define pag_sw1 MEMSIZ11.MEMSIZ1_BITS._pag_sw1
#define rom_sw0 MEMSIZ11.MEMSIZ1_BITS._rom_sw0
#define rom_sw1 MEMSIZ11.MEMSIZ1_BITS._rom_sw1

/**************************************************************************************************/
/*                                     INTERRUPT CONTROL REGISTER                                 */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char BIT0:1;
    unsigned char BIT1:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char BIT4:1;
    unsigned char BIT5:1;
    unsigned char _IRQEN:1;
    unsigned char _IRQE:1;
  } INTCR_BITS;        
  unsigned char INTCR_BYTE;  
}INTCR1 _IO_AT(0x1E);       

/*DEFINE REGISTER*/
#define INTCR INTCR1.INTCR_BYTE

/*DEFINE REGISTER BITS*/
#define IRQEN INTCR1.INTCR_BITS._IRQEN
#define IRQE INTCR1.INTCR_BITS._IRQE

/**************************************************************************************************/
/*                                   HIGHEST PRIORITY I INTERRUPT                                 */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char BIT0:1;
    unsigned char _PSEL1:1;
    unsigned char _PSEL2:1;
    unsigned char _PSEL3:1;
    unsigned char _PSEL4:1;
    unsigned char _PSEL5:1;
    unsigned char _PSEL6:1;
    unsigned char _PSEL7:1;
  } HPRIO_BITS;        
  unsigned char HPRIO_BYTE;  
}HPRIO1 _IO_AT(0x1F);       

/*DEFINE REGISTER*/
#define HPRIO HPRIO1.HPRIO_BYTE

/*DEFINE REGISTER BITS*/
#define PSEL1 HPRIO1.HPRIO_BITS._PSEL1
#define PSEL2 HPRIO1.HPRIO_BITS._PSEL2
#define PSEL3 HPRIO1.HPRIO_BITS._PSEL3
#define PSEL4 HPRIO1.HPRIO_BITS._PSEL4
#define PSEL5 HPRIO1.HPRIO_BITS._PSEL5
#define PSEL6 HPRIO1.HPRIO_BITS._PSEL6
#define PSEL7 HPRIO1.HPRIO_BITS._PSEL7

/**************************************************************************************************/
/*                                   BREAKPOINT CONTROL REGISTER 0                                */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char BIT0:1;
    unsigned char BIT1:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char _BKTAG:1;
    unsigned char _BKBDM:1;
    unsigned char _BKFULL:1;
    unsigned char _BKEN:1;
  } BKPCT0_BITS;        
  unsigned char BKPCT0_BYTE;  
}BKPCT01 _IO_AT(0x28);       

/*DEFINE REGISTER*/
#define BKPCT0 BKPCT01.BKPCT0_BYTE

/*DEFINE REGISTER BITS*/
#define BKTAG  BKPCT01.BKPCT0_BITS._BKTAG
#define BKBDM  BKPCT01.BKPCT0_BITS._BKBDM
#define BKFULL BKPCT01.BKPCT0_BITS._BKFULL
#define BKEN   BKPCT01.BKPCT0_BITS._BKEN

/*******************************************************************************************/
/*                                   BREAKPOINT CONTROL REGISTER 1                         */
/*******************************************************************************************/
 volatile  union {                                                                           
  struct {                                                                            
    unsigned char _BK1RW:1;                                                               
    unsigned char _BK1RWE:1;                                                               
    unsigned char _BK0RW:1;                                                             
    unsigned char _BK0RWE:1;                                                             
    unsigned char _BK1MBL:1;                                                               
    unsigned char _BK1MBH:1;                                                               
    unsigned char _BK0MBL:1;                                                              
    unsigned char _BK0MBH:1;                                                              
  } BKPCT1_BITS;                                                                      
  unsigned char BKPCT1_BYTE;                                                                
}BKPCT11 _IO_AT(0x29);                                                               

/*DEFINE REGISTER*/                                                                         
#define BKPCT1 BKPCT11.BKPCT1_BYTE                                                           

/*DEFINE REGISTER BITS*/                                                                    
#define BK1RW BKPCT11.BKPCT1_BITS._BK1RW                                                    
#define BK1RWE BKPCT11.BKPCT1_BITS._BK1RWE                                                    
#define BK0RW BKPCT11.BKPCT1_BITS._BK0RW                                                        
#define BK0RWE BKPCT11.BKPCT1_BITS._BK0RWE
#define BK1MBL BKPCT11.BKPCT1_BITS._BK1MBL                                                       
#define BK1MBH BKPCT11.BKPCT1_BITS._BK1MBH
#define BK0MBL BKPCT11.BKPCT1_BITS._BK0MBL                                                       
#define BK0MBH BKPCT11.BKPCT1_BITS._BK0MBH                                                       

/*******************************************************************************************/
/*                           BREAKPOINT DATA AND ADDRESS REGISTERS                         */
/*******************************************************************************************/
 volatile  unsigned char BKP0X    _IO_AT(0x2A);  /* Breakpoint Address Register,Bank Number*/
 volatile  unsigned int  BKP0     _IO_AT(0x2B);  /* Breakpoint Address Register*/

 volatile  unsigned char BKP1X    _IO_AT(0x2D);  /* Breakpoint Address Register,Bank Number*/
 volatile  unsigned int  BKP1     _IO_AT(0x2E);  /* Breakpoint Data Register*/

/*******************************************************************************************/
/*                             (PROGRAM) PAGE INDEX REGISTER                               */                                
/*******************************************************************************************/
 volatile  unsigned char PPAGE    _IO_AT(0x30);  

/*******************************************************************************************/
/*                                              PORT K                                     */                                
/*******************************************************************************************/
 volatile  unsigned char PORTK    _IO_AT(0x32);  /* port K */

 volatile  unsigned char DDRK     _IO_AT(0x33);  /* data direction port K */

/*******************************************************************************************/
/*                                    SYNTHETIZER REGISTER                                 */
/*******************************************************************************************/
/* Bits 6-7 is this registers are unimplemented. They cannot be used. */
 volatile  unsigned char SYNR _IO_AT(0x34);

/*******************************************************************************************/
/*                              REFERENCE DIVIDER REGISTER                                 */
/*******************************************************************************************/
/* Bits 4-7 is this registers are unimplemented. They cannot be used. */
 volatile  unsigned char REFDV _IO_AT(0x35);

