SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                     CLOCK GENERATOR TEST REGISTER                              */
/**************************************************************************************************/
 volatile  unsigned char  CTFLG    _IO_AT(0x36);  

/**************************************************************************************************/
/*                                   CLOCK GENERATOR FLAG REGISTER                                */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _SCM:1;
    unsigned char _SCMIF:1;
    unsigned char _TRACK:1;
    unsigned char _LOCK:1;
    unsigned char _LOCKIF:1;
    unsigned char BIT5:1;
    unsigned char _PROF:1;
    unsigned char _RTIF:1;
  } CRGFLG_BITS;        
  unsigned char CRGFLG_BYTE;  
}CRGFLG1 _IO_AT(0x37);       

/*DEFINE REGISTER*/
#define CRGFLG CRGFLG1.CRGFLG_BYTE

/*DEFINE REGISTER BITS*/
#define SCM   CRGFLG1.CRGFLG_BITS._SCM
#define SCMIF CRGFLG1.CRGFLG_BITS._SCMIF
#define TRACK CRGFLG1.CRGFLG_BITS._TRACK
#define LOCK  CRGFLG1.CRGFLG_BITS._LOCK
#define LOCKIF CRGFLG1.CRGFLG_BITS._LOCKIF
#define PROF  CRGFLG1.CRGFLG_BITS._PROF
#define RTIF  CRGFLG1.CRGFLG_BITS._RTIF

/**************************************************************************************************/
/*                             CLOCK GENERATOR INTERRUPT MASK REGISTER                            */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char BIT0:1;
    unsigned char _SCMIE:1;
    unsigned char BIT2:1;
    unsigned char BIT3:1;
    unsigned char _LOCKIE:1;
    unsigned char BIT5:1;
    unsigned char BIT6:1;
    unsigned char _RTIE:1;
  } CRGINT_BITS;        
  unsigned char CRGINT_BYTE;  
}CRGINT1 _IO_AT(0x38);       

/*DEFINE REGISTER*/
#define CRGINT CRGINT1.CRGINT_BYTE

/*DEFINE REGISTER BITS*/
#define SCMIE CRGINT1.CRGINT_BITS._SCMIE
#define LOCKIE CRGINT1.CRGINT_BITS._LOCKIE
#define RTIE CRGINT1.CRGINT_BITS._RTIE

/*******************************************************************************************/
/*                     CLOCK GENERATOR CLOCK SELECT REGISTER                               */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _COPWAI:1;               
    unsigned char _RTIWAI:1;              
    unsigned char _CWAI:1;               
    unsigned char _PLLWAI:1;              
    unsigned char _ROAWAI:1;               
    unsigned char _SYSWAI:1;               
    unsigned char _PSTP:1;               
    unsigned char _PLLSEL:1;                
  } CLKSEL_BITS;                       
  unsigned char CLKSEL_BYTE;                 
}CLKSEL1 _IO_AT(0x39);                

/*DEFINE REGISTER*/                          
#define CLKSEL CLKSEL1.CLKSEL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define COPWAI CLKSEL1.CLKSEL_BITS._COPWAI
#define RTIWAI CLKSEL1.CLKSEL_BITS._RTIWAI
#define CWAI   CLKSEL1.CLKSEL_BITS._CWAI
#define PLLWAI CLKSEL1.CLKSEL_BITS._PLLWAI
#define ROAWAI CLKSEL1.CLKSEL_BITS._ROAWAI
#define SYSWAI CLKSEL1.CLKSEL_BITS._SYSWAI
#define PSTP   CLKSEL1.CLKSEL_BITS._PSTP
#define PLLSEL CLKSEL1.CLKSEL_BITS._PLLSEL

/*******************************************************************************************/
/*                                              PLL CONTROL REGISTER                       */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _SCME:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1;               
    unsigned char BIT3:1;              
    unsigned char _ACQ:1;               
    unsigned char _AUTO:1;               
    unsigned char _PLLON:1;               
    unsigned char _CME:1;                
  } PLLCTL_BITS;                       
  unsigned char PLLCTL_BYTE;                 
}PLLCTL1 _IO_AT(0x3A);                

/*DEFINE REGISTER*/                          
#define PLLCTL PLLCTL1.PLLCTL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SCME  PLLCTL1.PLLCTL_BITS._SCME
#define ACQ   PLLCTL1.PLLCTL_BITS._ACQ
#define AUTO  PLLCTL1.PLLCTL_BITS._AUTO
#define PLLON PLLCTL1.PLLCTL_BITS._PLLON
#define CME   PLLCTL1.PLLCTL_BITS._CME

/**************************************************************************************************/
/*                                     REAL-TIME INTERRUPT ENABLE                                 */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _RTR0:1;
    unsigned char _RTR1:1;
    unsigned char _RTR2:1;
    unsigned char _RTR3:1;
    unsigned char _RTR4:1;
    unsigned char _RTR5:1;
    unsigned char _RTR6:1;
    unsigned char BIT7:1;
  } RTICTL_BITS;        
  unsigned char RTICTL_BYTE;  
}RTICTL1 _IO_AT(0x3B);       

/*DEFINE REGISTER*/
#define RTICTL RTICTL1.RTICTL_BYTE

/*DEFINE REGISTER BITS*/
#define RTR0 RTICTL1.RTICTL_BITS._RTR0
#define RTR1 RTICTL1.RTICTL_BITS._RTR1
#define RTR2 RTICTL1.RTICTL_BITS._RTR2
#define RTR3 RTICTL1.RTICTL_BITS._RTR3
#define RTR4 RTICTL1.RTICTL_BITS._RTR4
#define RTR5 RTICTL1.RTICTL_BITS._RTR5
#define RTR6 RTICTL1.RTICTL_BITS._RTR6

/**************************************************************************************************/
/*                                       COP CONTROL REGISTER                                     */
/**************************************************************************************************/
 volatile  union {                  
  struct {          
    unsigned char _CR0:1;
    unsigned char _CR1:1;
    unsigned char _CR2:1;
    unsigned char BIT3:1;
    unsigned char BIT4:1;
    unsigned char BIT5:1;
    unsigned char BIT6:1;
    unsigned char _WCOP:1;
  } COPCTL_BITS;        
  unsigned char COPCTL_BYTE;  
}COPCTL1 _IO_AT(0x3C);       

/*DEFINE REGISTER*/
#define COPCTL COPCTL1.COPCTL_BYTE

/*DEFINE REGISTER BITS*/
#define CR0  COPCTL1.COPCTL_BITS._CR0
#define CR1  COPCTL1.COPCTL_BITS._CR1
#define CR2  COPCTL1.COPCTL_BITS._CR2
#define WCOP COPCTL1.COPCTL_BITS._WCOP

