SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                    ATD PORTS STRUCTURE                                         */
/**************************************************************************************************/
/**********ATD CONTROL REGISTER 2********/
typedef  union {                            
  struct {                             
    unsigned char _ASCIF:1;               
    unsigned char _ASCIE:1;              
    unsigned char _ETRIG:1;               
    unsigned char _ETRIGP:1;              
    unsigned char _ETRIGLE:1;               
    unsigned char _AWAI:1;               
    unsigned char _AFFC:1;               
    unsigned char _ADPU:1;                
  } ATDCTL2_BITS;                       
  unsigned char ATDCTL2_BYTE;                 
}ATDCTL2_TYPE;                

/**********ATD CONTROL REGISTER 3********/
typedef  union {                         
  struct {                          
    unsigned char _FRZ0:1;            
    unsigned char _FRZ1:1;            
    unsigned char _FIFO:1;             
    unsigned char _S1C:1;             
    unsigned char _S2C:1;             
    unsigned char _S4C:1;            
    unsigned char _S8C:1;             
    unsigned char BIT7:1;             
  } ATDCTL3_BITS;                   
  unsigned char ATDCTL3_BYTE;               
}ATDCTL3_TYPE;            

/**********ATD CONTROL REGISTER 4********/
typedef  union {                         
  struct {                          
    unsigned char _PRS0:1;            
    unsigned char _PRS1:1;            
    unsigned char _PRS2:1;             
    unsigned char _PRS3:1;             
    unsigned char _PRS4:1;             
    unsigned char _SMP0:1;            
    unsigned char _SMP1:1;             
    unsigned char _SRES8:1;             
  } ATDCTL4_BITS;                   
  unsigned char ATDCTL4_BYTE;               
}ATDCTL4_TYPE;            

/**********ATD CONTROL REGISTER 5********/
typedef  union {                         
  struct {                          
    unsigned char _CA:1;            
    unsigned char _CB:1;            
    unsigned char _CC:1;             
    unsigned char BIT3:1;             
    unsigned char _MULT:1;             
    unsigned char _SCAN:1;            
    unsigned char _DSGN:1;             
    unsigned char _DJM:1;             
  } ATDCTL5_BITS;                   
  unsigned char ATDCTL5_BYTE;               
}ATDCTL5_TYPE;            

/**********ATD STATUS REGISTER********/
typedef  union {                         
  struct {                          
    unsigned int  _CC0:1;          
    unsigned int  _CC1:1;
    unsigned int  _CC2:1;           
    unsigned int  BIT3:1;           
    unsigned int  _FIFOR:1;
    unsigned int  _ETORF:1;
    unsigned int  BIT6:1;
    unsigned int  _SCF:1;
    unsigned int  _CCF0:1;
    unsigned int  _CCF1:1;
    unsigned int  _CCF2:1;
    unsigned int  _CCF3:1;
    unsigned int  _CCF4:1;
    unsigned int  _CCF5:1;
    unsigned int  _CCF6:1;
    unsigned int  _CCF7:1;           
  } ATDSTAT_BITS;                 
  unsigned int ATDSTAT_WORD;               
}ATDSTAT_TYPE;            

/********ATD TEST REGISTER HIGH*********/
typedef  union {                            
  struct {                             
    unsigned char _SAR2:1;               
    unsigned char _SAR3:1;              
    unsigned char _SAR4:1;               
    unsigned char _SAR5:1;              
    unsigned char _SAR6:1;               
    unsigned char _SAR7:1;               
    unsigned char _SAR8:1;               
    unsigned char _SAR9:1;                
  } ATDTEST0_BITS;                      
  unsigned char ATDTEST0_BYTE;                 
} ATDTEST0_TYPE;     

/********ATD TEST REGISTER LOW**********/
typedef  union {                            
  struct {                             
    unsigned char _SC:1;               
    unsigned char BIT1:1;              
    unsigned char _RST:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char _SAR0:1;               
    unsigned char _SAR1:1;                
  } ATDTEST1_BITS;                       
  unsigned char ATDTEST1_BYTE;                 
} ATDTEST1_TYPE;
                           
/**************************************************************************************************/
/*                                  ATD 0 RESERVED REGISTERS                                      */
/**************************************************************************************************/
 volatile  unsigned char ATD0CTL0  _IO_AT(0x80); /* A/D control register 0 */
 volatile  unsigned char ATD0CTL1  _IO_AT(0x81); /* A/D control register 1 */

/**************************************************************************************************/
/*                                   ATD 0 CONTROL REGISTERS                                      */
/**************************************************************************************************/

/**********ATD CONTROL REGISTER 2********/
 volatile  ATDCTL2_TYPE ATD0CTL21 _IO_AT(0x82);                

/*DEFINE REGISTER*/                          
#define ATD0CTL2 ATD0CTL21.ATDCTL2_BYTE            

/*DEFINE REGISTER BITS*/                      
#define ASCIF_0   ATD0CTL21.ATDCTL2_BITS._ASCIF       
#define ASCIE_0   ATD0CTL21.ATDCTL2_BITS._ASCIE
#define ETRIG_0   ATD0CTL21.ATDCTL2_BITS._ETRIG
#define ETRIGP_0  ATD0CTL21.ATDCTL2_BITS._ETRIGP
#define ETRIGLE_0 ATD0CTL21.ATDCTL2_BITS._ETRIGLE
#define ASWAI_0   ATD0CTL21.ATDCTL2_BITS._AWAI
#define AFFC_0    ATD0CTL21.ATDCTL2_BITS._AFFC
#define ADPU_0    ATD0CTL21.ATDCTL2_BITS._ADPU

/**********ATD CONTROL REGISTER 3********/
 volatile  ATDCTL3_TYPE ATD0CTL31 _IO_AT(0x83);            

/*DEFINE REGISTER*/                       
#define ATD0CTL3 ATD0CTL31.ATDCTL3_BYTE      

/*DEFINE REGISTER BITS*/                  
#define FRZ0_0 ATD0CTL31.ATDCTL3_BITS._FRZ0  
#define FRZ1_0 ATD0CTL31.ATDCTL3_BITS._FRZ1 
#define FIFO_0 ATD0CTL31.ATDCTL3_BITS._FIFO  
#define S1C_0  ATD0CTL31.ATDCTL3_BITS._S1C 
#define S2C_0  ATD0CTL31.ATDCTL3_BITS._S2C  
#define S4C_0  ATD0CTL31.ATDCTL3_BITS._S4C 
#define S8C_0  ATD0CTL31.ATDCTL3_BITS._S8C  

/**********ATD CONTROL REGISTER 4********/
 volatile  ATDCTL4_TYPE ATD0CTL41 _IO_AT(0x84);            

/*DEFINE REGISTER*/                       
#define ATD0CTL4 ATD0CTL41.ATDCTL4_BYTE      

/*DEFINE REGISTER BITS*/                  
#define PRS0_0  ATD0CTL41.ATDCTL4_BITS._PRS0  
#define PRS1_0  ATD0CTL41.ATDCTL4_BITS._PRS1  
#define PRS2_0  ATD0CTL41.ATDCTL4_BITS._PRS2  
#define PRS3_0  ATD0CTL41.ATDCTL4_BITS._PRS3  
#define PRS4_0  ATD0CTL41.ATDCTL4_BITS._PRS4  
#define SMP0_0  ATD0CTL41.ATDCTL4_BITS._SMP0
#define SMP1_0  ATD0CTL41.ATDCTL4_BITS._SMP1
#define SRES8_0 ATD0CTL41.ATDCTL4_BITS._SRES8

