SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**********ATD CONTROL REGISTER 5********/
 volatile  ATDCTL5_TYPE ATD0CTL51 _IO_AT(0x85);            

/*DEFINE REGISTER*/                       
#define ATD0CTL5 ATD0CTL51.ATDCTL5_BYTE      

/*DEFINE REGISTER BITS*/                  
#define CA_0   ATD0CTL51.ATDCTL5_BITS._CA  
#define CB_0   ATD0CTL51.ATDCTL5_BITS._CB  
#define CC_0   ATD0CTL51.ATDCTL5_BITS._CC  
#define MULT_0 ATD0CTL51.ATDCTL5_BITS._MULT  
#define SCAN_0 ATD0CTL51.ATDCTL5_BITS._SCAN
#define DSGN_0 ATD0CTL51.ATDCTL5_BITS._DSGN   
#define DJM_0  ATD0CTL51.ATDCTL5_BITS._DJM   

/**************************************************************************************************/
/*                                   ATD 0 STATUS REGISTER                                        */
/**************************************************************************************************/
 volatile  ATDSTAT_TYPE ATD0STAT1 _IO_AT(0x86);            

/*DEFINE REGISTER*/                       
#define ATD0STAT ATD0STAT1.ATDSTAT_WORD      

/*DEFINE REGISTER BITS*/                  
#define CC0_0   ATD0STAT1.ATDSTAT_BITS._CC0  
#define CC1_0   ATD0STAT1.ATDSTAT_BITS._CC1
#define CC2_0   ATD0STAT1.ATDSTAT_BITS._CC2
#define FIFOR_0 ATD0STAT1.ATDSTAT_BITS._FIFOR
#define ETORF_0 ATD0STAT1.ATDSTAT_BITS._ETORF
#define SCF_0   ATD0STAT1.ATDSTAT_BITS._SCF
#define CCF0_0  ATD0STAT1.ATDSTAT_BITS._CCF0
#define CCF1_0  ATD0STAT1.ATDSTAT_BITS._CCF1 
#define CCF2_0  ATD0STAT1.ATDSTAT_BITS._CCF2 
#define CCF3_0  ATD0STAT1.ATDSTAT_BITS._CCF3 
#define CCF4_0  ATD0STAT1.ATDSTAT_BITS._CCF4 
#define CCF5_0  ATD0STAT1.ATDSTAT_BITS._CCF5 
#define CCF6_0  ATD0STAT1.ATDSTAT_BITS._CCF6 
#define CCF7_0  ATD0STAT1.ATDSTAT_BITS._CCF7 

/*******************************************************************************************/
/*                                       ATD 0 TEST REGISTER                               */
/*******************************************************************************************/

/********ATD TEST REGISTER HIGH*********/
 volatile  ATDTEST0_TYPE ATD0TEST01 _IO_AT(0x88);                

/*DEFINE REGISTER*/                          
#define ATD0TEST0 ATD0TEST01.ATDTEST0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SAR2_0 ATD0TEST01.ATDTEST0_BITS._SAR2       
#define SAR3_0 ATD0TEST01.ATDTEST0_BITS._SAR3       
#define SAR4_0 ATD0TEST01.ATDTEST0_BITS._SAR4       
#define SAR5_0 ATD0TEST01.ATDTEST0_BITS._SAR5       
#define SAR6_0 ATD0TEST01.ATDTEST0_BITS._SAR6       
#define SAR7_0 ATD0TEST01.ATDTEST0_BITS._SAR7       
#define SAR8_0 ATD0TEST01.ATDTEST0_BITS._SAR8       
#define SAR9_0 ATD0TEST01.ATDTEST0_BITS._SAR9       

/********ATD TEST REGISTER LOW**********/
 volatile  ATDTEST1_TYPE ATD0TEST11 _IO_AT(0x89);                

/*DEFINE REGISTER*/                          
#define ATD0TEST1 ATD0TEST11.ATDTEST1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SC_0   ATD0TEST11.ATDTEST1_BITS._SC       
#define RST_0  ATD0TEST11.ATDTEST1_BITS._RST       
#define SAR0_0 ATD0TEST11.ATDTEST1_BITS._SAR0       
#define SAR1_0 ATD0TEST11.ATDTEST1_BITS._SAR1       

 volatile  unsigned char ATD0DIEN  _IO_AT(0x8D); 
 volatile  unsigned char PORTAD0   _IO_AT(0x8F); 
 volatile  unsigned int  ATD0DR0   _IO_AT(0x90); 
 volatile  unsigned int  ATD0DR1   _IO_AT(0x92); 
 volatile  unsigned int  ATD0DR2   _IO_AT(0x94); 
 volatile  unsigned int  ATD0DR3   _IO_AT(0x96); 
 volatile  unsigned int  ATD0DR4   _IO_AT(0x98); 
 volatile  unsigned int  ATD0DR5   _IO_AT(0x9A); 
 volatile  unsigned int  ATD0DR6   _IO_AT(0x9C); 
 volatile  unsigned int  ATD0DR7   _IO_AT(0x9E); 

/**************************************************************************************************/
/*                                  ATD 1 RESERVED REGISTERS                                      */
/**************************************************************************************************/
 volatile  unsigned char ATD1CTL0  _IO_AT(0x120); /* A/D control register 0 */
 volatile  unsigned char ATD1CTL1  _IO_AT(0x121); /* A/D control register 1 */

/**************************************************************************************************/
/*                                   ATD 1 CONTROL REGISTERS                                      */
/**************************************************************************************************/

/**********ATD CONTROL REGISTER 2********/
 volatile  ATDCTL2_TYPE ATD1CTL21 _IO_AT(0x122);                

/*DEFINE REGISTER*/                          
#define ATD1CTL2 ATD1CTL21.ATDCTL2_BYTE            

/*DEFINE REGISTER BITS*/                      
#define ASCIF_1   ATD1CTL21.ATDCTL2_BITS._ASCIF       
#define ASCIE_1   ATD1CTL21.ATDCTL2_BITS._ASCIE
#define ETRIG_1   ATD1CTL21.ATDCTL2_BITS._ETRIG
#define ETRIGP_1  ATD1CTL21.ATDCTL2_BITS._ETRIGP
#define ETRIGLE_1 ATD1CTL21.ATDCTL2_BITS._ETRIGLE
#define ASWAI_1   ATD1CTL21.ATDCTL2_BITS._AWAI
#define AFFC_1    ATD1CTL21.ATDCTL2_BITS._AFFC
#define ADPU_1    ATD1CTL21.ATDCTL2_BITS._ADPU

/**********ATD CONTROL REGISTER 3********/
 volatile  ATDCTL3_TYPE ATD1CTL31 _IO_AT(0x123);            

/*DEFINE REGISTER*/                       
#define ATD1CTL3 ATD1CTL31.ATDCTL3_BYTE      

/*DEFINE REGISTER BITS*/                  
#define FRZ0_1 ATD1CTL31.ATDCTL3_BITS._FRZ0  
#define FRZ1_1 ATD1CTL31.ATDCTL3_BITS._FRZ1 
#define FIFO_1 ATD1CTL31.ATDCTL3_BITS._FIFO  
#define S1C_1  ATD1CTL31.ATDCTL3_BITS._S1C 
#define S2C_1  ATD1CTL31.ATDCTL3_BITS._S2C  
#define S4C_1  ATD1CTL31.ATDCTL3_BITS._S4C 
#define S8C_1  ATD1CTL31.ATDCTL3_BITS._S8C  

/**********ATD CONTROL REGISTER 4********/
 volatile  ATDCTL4_TYPE ATD1CTL41 _IO_AT(0x124);            

/*DEFINE REGISTER*/                       
#define ATD1CTL4 ATD1CTL41.ATDCTL4_BYTE      

/*DEFINE REGISTER BITS*/                  
#define PRS0_1  ATD1CTL41.ATDCTL4_BITS._PRS0  
#define PRS1_1  ATD1CTL41.ATDCTL4_BITS._PRS1  
#define PRS2_1  ATD1CTL41.ATDCTL4_BITS._PRS2  
#define PRS3_1  ATD1CTL41.ATDCTL4_BITS._PRS3  
#define PRS4_1  ATD1CTL41.ATDCTL4_BITS._PRS4  
#define SMP0_1  ATD1CTL41.ATDCTL4_BITS._SMP0
#define SMP1_1  ATD1CTL41.ATDCTL4_BITS._SMP1
#define SRES8_1 ATD1CTL41.ATDCTL4_BITS._SRES8

