SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**********ATD CONTROL REGISTER 5********/
 volatile  ATDCTL5_TYPE ATD1CTL51 _IO_AT(0x125);            
                                                                 
/*DEFINE REGISTER*/                       
#define ATD1CTL5 ATD1CTL51.ATDCTL5_BYTE      

/*DEFINE REGISTER BITS*/                  
#define CA_1   ATD1CTL51.ATDCTL5_BITS._CA  
#define CB_1   ATD1CTL51.ATDCTL5_BITS._CB  
#define CC_1   ATD1CTL51.ATDCTL5_BITS._CC  
#define MULT_1 ATD1CTL51.ATDCTL5_BITS._MULT  
#define SCAN_1 ATD1CTL51.ATDCTL5_BITS._SCAN
#define DSGN_1 ATD1CTL51.ATDCTL5_BITS._DSGN   
#define DJM_1  ATD1CTL51.ATDCTL5_BITS._DJM   

/**************************************************************************************************/
/*                                   ATD 1 STATUS REGISTER                                        */
/**************************************************************************************************/
 volatile  ATDSTAT_TYPE ATD1STAT1 _IO_AT(0x126);            

/*DEFINE REGISTER*/                       
#define ATD1STAT ATD1STAT1.ATDSTAT_WORD      

/*DEFINE REGISTER BITS*/                  
#define CC0_1   ATD1STAT1.ATDSTAT_BITS._CC0  
#define CC1_1   ATD1STAT1.ATDSTAT_BITS._CC1
#define CC2_1   ATD1STAT1.ATDSTAT_BITS._CC2
#define FIFOR_1 ATD1STAT1.ATDSTAT_BITS._FIFOR
#define ETORF_1 ATD1STAT1.ATDSTAT_BITS._ETORF
#define SCF_1   ATD1STAT1.ATDSTAT_BITS._SCF
#define CCF0_1  ATD1STAT1.ATDSTAT_BITS._CCF0
#define CCF1_1  ATD1STAT1.ATDSTAT_BITS._CCF1 
#define CCF2_1  ATD1STAT1.ATDSTAT_BITS._CCF2 
#define CCF3_1  ATD1STAT1.ATDSTAT_BITS._CCF3 
#define CCF4_1  ATD1STAT1.ATDSTAT_BITS._CCF4 
#define CCF5_1  ATD1STAT1.ATDSTAT_BITS._CCF5 
#define CCF6_1  ATD1STAT1.ATDSTAT_BITS._CCF6 
#define CCF7_1  ATD1STAT1.ATDSTAT_BITS._CCF7 

/*******************************************************************************************/
/*                                       ATD 1 TEST REGISTER                               */
/*******************************************************************************************/

/********ATD TEST REGISTER HIGH*********/
 volatile  ATDTEST0_TYPE ATD1TEST01 _IO_AT(0x128);                

/*DEFINE REGISTER*/                          
#define ATD1TEST0 ATD1TEST01.ATDTEST0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SAR2_1 ATD1TEST01.ATDTEST0_BITS._SAR2       
#define SAR3_1 ATD1TEST01.ATDTEST0_BITS._SAR3       
#define SAR4_1 ATD1TEST01.ATDTEST0_BITS._SAR4       
#define SAR5_1 ATD1TEST01.ATDTEST0_BITS._SAR5       
#define SAR6_1 ATD1TEST01.ATDTEST0_BITS._SAR6       
#define SAR7_1 ATD1TEST01.ATDTEST0_BITS._SAR7       
#define SAR8_1 ATD1TEST01.ATDTEST0_BITS._SAR8       
#define SAR9_1 ATD1TEST01.ATDTEST0_BITS._SAR9       

/********ATD TEST REGISTER LOW**********/
 volatile  ATDTEST1_TYPE ATD1TEST11 _IO_AT(0x129);                

/*DEFINE REGISTER*/                          
#define ATD1TEST1 ATD1TEST11.ATDTEST1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SC_1   ATD1TEST11.ATDTEST1_BITS._SC       
#define RST_1  ATD1TEST11.ATDTEST1_BITS._RST       
#define SAR0_1 ATD1TEST11.ATDTEST1_BITS._SAR0       
#define SAR1_1 ATD1TEST11.ATDTEST1_BITS._SAR1       

 volatile  unsigned char ATD1DIEN  _IO_AT(0x12D); 
 volatile  unsigned char PORTAD1   _IO_AT(0x12F); 
 volatile  unsigned int  ATD1DR0   _IO_AT(0x130); 
 volatile  unsigned int  ATD1DR1   _IO_AT(0x132); 
 volatile  unsigned int  ATD1DR2   _IO_AT(0x134); 
 volatile  unsigned int  ATD1DR3   _IO_AT(0x136); 
 volatile  unsigned int  ATD1DR4   _IO_AT(0x138); 
 volatile  unsigned int  ATD1DR5   _IO_AT(0x13A); 
 volatile  unsigned int  ATD1DR6   _IO_AT(0x13C); 
 volatile  unsigned int  ATD1DR7   _IO_AT(0x13E); 

/*******************************************************************************************/
/*                                          PWM ENABLE                                     */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _PWME0:1;               
    unsigned char _PWME1:1;              
    unsigned char _PWME2:1;               
    unsigned char _PWME3:1;              
    unsigned char _PWME4:1;               
    unsigned char _PWME5:1;               
    unsigned char _PWME6:1;               
    unsigned char _PWME7:1;                
  } PWME_BITS;                       
  unsigned char PWME_BYTE;                 
}PWME_ _IO_AT(0xA0);                

/*DEFINE REGISTER*/                          
#define PWME PWME_.PWME_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PWME0 PWME_.PWME_BITS._PWME0       
#define PWME1 PWME_.PWME_BITS._PWME1     
#define PWME2 PWME_.PWME_BITS._PWME2       
#define PWME3 PWME_.PWME_BITS._PWME3     
#define PWME4 PWME_.PWME_BITS._PWME4       
#define PWME5 PWME_.PWME_BITS._PWME5       
#define PWME6 PWME_.PWME_BITS._PWME6       
#define PWME7 PWME_.PWME_BITS._PWME7       

/*******************************************************************************************/
/*                              PWM CLOCK SELECT AND POLARITY                              */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _PPOL0:1;               
    unsigned char _PPOL1:1;              
    unsigned char _PPOL2:1;               
    unsigned char _PPOL3:1;              
    unsigned char _PPOL4:1;               
    unsigned char _PPOL5:1;               
    unsigned char _PPOL6:1;               
    unsigned char _PPOL7:1;                
  } PWMPOL_BITS;                       
  unsigned char PWMPOL_BYTE;                 
}PWMPOL1 _IO_AT(0xA1);                

/*DEFINE REGISTER*/                          
#define PWMPOL PWMPOL1.PWMPOL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PPOL0 PWMPOL1.PWMPOL_BITS._PPOL0       
#define PPOL1 PWMPOL1.PWMPOL_BITS._PPOL1
#define PPOL2 PWMPOL1.PWMPOL_BITS._PPOL2
#define PPOL3 PWMPOL1.PWMPOL_BITS._PPOL3       
#define PPOL4 PWMPOL1.PWMPOL_BITS._PPOL4    
#define PPOL5 PWMPOL1.PWMPOL_BITS._PPOL5       
#define PPOL6 PWMPOL1.PWMPOL_BITS._PPOL6       
#define PPOL7 PWMPOL1.PWMPOL_BITS._PPOL7       

/*******************************************************************************************/
/*                               PWM CLOCK AND CONCATENATE                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _PCLK0:1;               
    unsigned char _PCLK1:1;              
    unsigned char _PCLK2:1;               
    unsigned char _PCLK3:1;              
    unsigned char _PCLK4:1;               
    unsigned char _PCLK5:1;               
    unsigned char _PCLK6:1;               
    unsigned char _PCLK7:1;                
  } PWMCLK_BITS;                       
  unsigned char PWMCLK_BYTE;                 
}PWMCLK1 _IO_AT(0xA2);                

/*DEFINE REGISTER*/                          
#define PWMCKL PWMCLK1.PWMCLK_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PCLK0 PWMCLK1.PWMCLK_BITS._PCLK0       
#define PCLK1 PWMCLK1.PWMCLK_BITS._PCLK1     
#define PCLK2 PWMCLK1.PWMCLK_BITS._PCLK2       
#define PCLK3 PWMCLK1.PWMCLK_BITS._PCLK3     
#define PCLK4 PWMCLK1.PWMCLK_BITS._PCLK4       
#define PCLK5 PWMCLK1.PWMCLK_BITS._PCLK5       
#define PCLK6 PWMCLK1.PWMCLK_BITS._PCLK6       
#define PCLK7 PWMCLK1.PWMCLK_BITS._PCLK7       

/*******************************************************************************************/
/*                                                               */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _PCKA0:1;               
    unsigned char _PCKA1:1;              
    unsigned char _PCKA2:1;               
    unsigned char BIT3:1;              
    unsigned char _PCKB0:1;               
    unsigned char _PCKB1:1;               
    unsigned char _PCKB2:1;               
    unsigned char BIT7:1;                
  } PWMPRCLK_BITS;                       
  unsigned char PWMPRCLK_BYTE;                 
}PWMPRCLK1 _IO_AT(0xA3);                

/*DEFINE REGISTER*/                          
#define PWMPRCLK PWMPRCLK1.PWMPRCLK_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PCKA0 PWMPRCLK1.PWMPRCLK_BITS._PCKA0       
#define PCKA1 PWMPRCLK1.PWMPRCLK_BITS._PCKA1     
#define PCKA2 PWMPRCLK1.PWMPRCLK_BITS._PCKA2       
#define PCKB0 PWMPRCLK1.PWMPRCLK_BITS._PCKB0     
#define PCKB1 PWMPRCLK1.PWMPRCLK_BITS._PCKB1       
#define PCKB2 PWMPRCLK1.PWMPRCLK_BITS._PCKB2       

/*******************************************************************************************/
/*                                                              */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _CAE0:1;               
    unsigned char _CAE1:1;              
    unsigned char _CAE2:1;               
    unsigned char _CAE3:1;              
    unsigned char _CAE4:1;               
    unsigned char _CAE5:1;               
    unsigned char _CAE6:1;               
    unsigned char _CAE7:1;                
  } PWMCAE_BITS;                       
  unsigned char PWMCAE_BYTE;                 
}PWMCAE1 _IO_AT(0xA4);                

/*DEFINE REGISTER*/                          
#define PWMCAE PWMCAE1.PWMCAE_BYTE            

/*DEFINE REGISTER BITS*/                     
#define CAE0 PWMCAE1.PWMCAE_BITS._CAE0       
#define CAE1 PWMCAE1.PWMCAE_BITS._CAE1     
#define CAE2 PWMCAE1.PWMCAE_BITS._CAE2       
#define CAE3 PWMCAE1.PWMCAE_BITS._CAE3     
#define CAE4 PWMCAE1.PWMCAE_BITS._CAE4       
#define CAE5 PWMCAE1.PWMCAE_BITS._CAE5       
#define CAE6 PWMCAE1.PWMCAE_BITS._CAE6       
#define CAE7 PWMCAE1.PWMCAE_BITS._CAE7       

/*******************************************************************************************/
/*                                PWM CONTROL REGISTER                                     */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char _PFRZ:1;               
    unsigned char _PSWAI:1;              
    unsigned char _CON01:1;               
    unsigned char _CON23:1;               
    unsigned char _CON45:1;               
    unsigned char _CON67:1;                
  } PWMCTL_BITS;                       
  unsigned char PWMCTL_BYTE;                 
}PWMCTL1 _IO_AT(0xA5);                

/*DEFINE REGISTER*/                          
#define PWMCTL PWMCTL1.PWMCTL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PFRZ  PWMCTL1.PWMCTL_BITS._PFRZ       
#define PSWAI PWMCTL1.PWMCTL_BITS._PSWAI     
#define CON01 PWMCTL1.PWMCTL_BITS._CON01       
#define CON23 PWMCTL1.PWMCTL_BITS._CON23     
#define CON45 PWMCTL1.PWMCTL_BITS._CON45       
#define CON67 PWMCTL1.PWMCTL_BITS._CON67       

/*******************************************************************************************/
/*                              PWM SPECIAL MODE REGISTER (TEST)                           */
/*******************************************************************************************/
 volatile  unsigned char PWMTST   _IO_AT(0xA6);  /* PWM Test Register */

/*******************************************************************************************/
/*                                 PWM PRESCALE COUNTER                                    */
/*******************************************************************************************/
 volatile  unsigned char PWMPRSC   _IO_AT(0xA7);  /* PWM Prescale Counter */

/*******************************************************************************************/
/*                                 PWM SCALE REGISTER A                                    */
/*******************************************************************************************/
 volatile  unsigned char PWMSCALA  _IO_AT(0xA8); /* PWM Scale A */

/*******************************************************************************************/
/*                                 PWM SCALE REGISTER B                                    */
/*******************************************************************************************/
 volatile  unsigned char PWMSCALB  _IO_AT(0xA9); /* PWM Scale B */

/*******************************************************************************************/
/*                                 PWM SCALE COUNTER VALUE A                               */
/*******************************************************************************************/
 volatile  unsigned char PWMSCNTA  _IO_AT(0xAA); /* PWM Counter A */

/*******************************************************************************************/
/*                                 PWM SCALE COUNTER VALUE B                               */
/*******************************************************************************************/
 volatile  unsigned char PWMSCNTB  _IO_AT(0xAB); /* PWM Counter B */

/*******************************************************************************************/
/*                                      PWM CHANNEL COUNTERS                               */
/*******************************************************************************************/
 volatile  unsigned char PWMCNT0   _IO_AT(0xAC);  /* PWM Channel Counter 0 */
 volatile  unsigned char PWMCNT1   _IO_AT(0xAD);  /* PWM Channel Counter 1 */
 volatile  unsigned char PWMCNT2   _IO_AT(0xAE);  /* PWM Channel Counter 2 */
 volatile  unsigned char PWMCNT3   _IO_AT(0xAF);  /* PWM Channel Counter 3 */
 volatile  unsigned char PWMCNT4   _IO_AT(0xB0);  /* PWM Channel Counter 4 */
 volatile  unsigned char PWMCNT5   _IO_AT(0xB1);  /* PWM Channel Counter 5 */
 volatile  unsigned char PWMCNT6   _IO_AT(0xB2);  /* PWM Channel Counter 6 */
 volatile  unsigned char PWMCNT7   _IO_AT(0xB3);  /* PWM Channel Counter 7 */

/*******************************************************************************************/
/*                              PWM CHANNEL PERIOD REGISTERS                               */
/*******************************************************************************************/
 volatile  unsigned char PWMPER0   _IO_AT(0xB4);  /* PWM Channel Period 0 */
 volatile  unsigned char PWMPER1   _IO_AT(0xB5);  /* PWM Channel Period 1 */
 volatile  unsigned char PWMPER2   _IO_AT(0xB6);  /* PWM Channel Period 2 */
 volatile  unsigned char PWMPER3   _IO_AT(0xB7);  /* PWM Channel Period 3 */
 volatile  unsigned char PWMPER4   _IO_AT(0xB8);  /* PWM Channel Period 4 */
 volatile  unsigned char PWMPER5   _IO_AT(0xB9);  /* PWM Channel Period 5 */
 volatile  unsigned char PWMPER6   _IO_AT(0xBA);  /* PWM Channel Period 6 */
 volatile  unsigned char PWMPER7   _IO_AT(0xBB);  /* PWM Channel Period 7 */

/*******************************************************************************************/
/*                                PWM CHANNEL DUTY REGISTERS                               */
/*******************************************************************************************/
 volatile  unsigned char PWMDTY0   _IO_AT(0xBC);  /* PWM Channel Duty 0 */
 volatile  unsigned char PWMDTY1   _IO_AT(0xBD);  /* PWM Channel Duty 1 */
 volatile  unsigned char PWMDTY2   _IO_AT(0xBE);  /* PWM Channel Duty 2 */
 volatile  unsigned char PWMDTY3   _IO_AT(0xBF);  /* PWM Channel Duty 3 */
 volatile  unsigned char PWMDTY4   _IO_AT(0xC0);  /* PWM Channel Duty 4 */
 volatile  unsigned char PWMDTY5   _IO_AT(0xC1);  /* PWM Channel Duty 5 */
 volatile  unsigned char PWMDTY6   _IO_AT(0xC2);  /* PWM Channel Duty 6 */
 volatile  unsigned char PWMDTY7   _IO_AT(0xC3);  /* PWM Channel Duty 7 */

/*******************************************************************************************/
/*                                                                     */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _PWM7ENA:1;               
    unsigned char _PWM7INL:1;              
    unsigned char _PWN7IN:1;               
    unsigned char BIT3:1;              
    unsigned char _PWMLVL:1;               
    unsigned char _PWMRSTRT:1;               
    unsigned char _PWMIE:1;               
    unsigned char _PWMIF:1;                
  } PWMSDN_BITS;                       
  unsigned char PWMSD_BYTE;                 
}PWMSDN1 _IO_AT(0xC4);                

/*DEFINE REGISTER*/                          
#define PWMSDN PWMSDN1.PWMSD_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PWM7ENA  PWMSDN1.PWMSDN_BITS._PWM7ENA       
#define PWM7INL  PWMSDN1.PWMSDN_BITS._PWM7INL     
#define PWN7IN   PWMSDN1.PWMSDN_BITS._PWN7IN       
#define PWMLVL   PWMSDN1.PWMSDN_BITS._PWMLVL     
#define PWMRSTRT PWMSDN1.PWMSDN_BITS._PWMRSTRT       
#define PWMIE    PWMSDN1.PWMSDN_BITS._PWMIE       
#define PWMIF    PWMSDN1.PWMSDN_BITS._PWMIF       

/*******************************************************************************************/
/*                                SCI PORTS STRUCTURE                                      */
/*******************************************************************************************/
/*****SCI BAUD RATE CONTROL REGISTER HIGH*****/
typedef  union {                            
  struct {                             
    unsigned char _SBR8:1;               
    unsigned char _SBR9:1;              
    unsigned char _SBR10:1;               
    unsigned char _SBR11:1;              
    unsigned char _SBR12:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } SCIBDH_BITS;                       
  unsigned char SCIBDH_BYTE;                 
} SCIBDH_TYPE;                

/*****SCI BAUD RATE CONTROL REGISTER LOW*****/
typedef  union {                            
  struct {                             
    unsigned char _SBR0:1;               
    unsigned char _SBR1:1;              
    unsigned char _SBR2:1;               
    unsigned char _SBR3:1;              
    unsigned char _SBR4:1;               
    unsigned char _SBR5:1;               
    unsigned char _SBR6:1;               
    unsigned char _SBR7:1;                
  } SCIBDL_BITS;                       
  unsigned char SCIBDL_BYTE;                 
} SCIBDL_TYPE;                

