SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/*****SCI CONTROL REGISTER 1*****/
typedef  union {                            
  struct {                             
    unsigned char _PT:1;               
    unsigned char _PE:1;              
    unsigned char _ILT:1;               
    unsigned char _WAKE:1;              
    unsigned char _M:1;               
    unsigned char _RSRC:1;               
    unsigned char _SCISWAI:1;               
    unsigned char _LOOPS:1;                
  } SCICR1_BITS;                       
  unsigned char SCICR1_BYTE;                 
} SCICR1_TYPE;                

/*****SCI CONTROL REGISTER 2*****/
typedef  union {                            
  struct {                             
    unsigned char _SBK:1;               
    unsigned char _RWU:1;              
    unsigned char _RE:1;               
    unsigned char _TE:1;              
    unsigned char _ILIE:1;               
    unsigned char _RIE:1;               
    unsigned char _TCIE:1;               
    unsigned char _TIE:1;                
  } SCICR2_BITS;                       
  unsigned char SCICR2_BYTE;                 
} SCICR2_TYPE;                

/*****SCI STATUS REGISTER 1*****/
typedef  union {                            
  struct {                             
    unsigned char _PF:1;               
    unsigned char _FE:1;              
    unsigned char _NF:1;               
    unsigned char _OR:1;              
    unsigned char _IDLE:1;               
    unsigned char _RDRF:1;               
    unsigned char _TC:1;               
    unsigned char _TDRE:1;                    
  } SCISR1_BITS;                       
  unsigned char SCISR1_BYTE;                 
} SCISR1_TYPE;                

/*****SCI STATUS REGISTER 2*****/
typedef  union {                            
  struct {                             
    unsigned char _RAF:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } SCISR2_BITS;                       
  unsigned char SCISR2_BYTE;                 
} SCISR2_TYPE;                


/*****SCI DATA REGISTER  HIGH     *****/
typedef  union {
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char _T8:1;               
    unsigned char _R8:1;                    
  } SCIDRH_BITS;                       
  unsigned char SCIDRH_BYTE;                 
} SCIDRH_TYPE;                

/*******************************************************************************************/
/*                            SCI BAUD RATE CONTROL REGISTERS 0                            */
/*******************************************************************************************/

/*****SCI BAUD RATE CONTROL REGISTER 0 HIGH*****/
 volatile  SCIBDH_TYPE SCI0BDH1 _IO_AT(0xC8);                

/*DEFINE REGISTER*/                          
#define SCI0BDH SCI0BDH1.SCIBDH_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SBR8_0  SCI0BDH1.SCIBDH_BITS._SBR8
#define SBR9_0  SCI0BDH1.SCIBDH_BITS._SBR9     
#define SBR10_0 SCI0BDH1.SCIBDH_BITS._SBR10       
#define SBR11_0 SCI0BDH1.SCIBDH_BITS._SBR11      
#define SBR12_0 SCI0BDH1.SCIBDH_BITS._SBR12      

/*****SCI BAUD RATE CONTROL REGISTER 0 LOW*****/
 volatile  SCIBDL_TYPE SCI0BDL1 _IO_AT(0xC9);                

/*DEFINE REGISTER*/                          
#define SCI0BDL SCI0BDL1.SCIBDL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SBR0_0 SCI0BDL1.SCIBDL_BITS._SBR0       
#define SBR1_0 SCI0BDL1.SCIBDL_BITS._SBR1    
#define SBR2_0 SCI0BDL1.SCIBDL_BITS._SBR2       
#define SBR3_0 SCI0BDL1.SCIBDL_BITS._SBR3      
#define SBR4_0 SCI0BDL1.SCIBDL_BITS._SBR4      
#define SBR5_0 SCI0BDL1.SCIBDL_BITS._SBR5    
#define SBR6_0 SCI0BDL1.SCIBDL_BITS._SBR6
#define SBR7_0 SCI0BDL1.SCIBDL_BITS._SBR7

/*******************************************************************************************/
/*                                 SCI 0 CONTROL REGISTERS                                 */
/*******************************************************************************************/

/*****SCI 0 CONTROL REGISTER 1*****/
 volatile  SCICR1_TYPE SCI0CR11 _IO_AT(0xCA);                

/*DEFINE REGISTER*/                          
#define SCI0CR1 SCI0CR11.SCICR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PT_0      SCI0CR11.SCICR1_BITS._PT      
#define PE_0      SCI0CR11.SCICR1_BITS._PE     
#define ILT_0     SCI0CR11.SCICR1_BITS._ILT       
#define WAKE_0    SCI0CR11.SCICR1_BITS._WAKE      
#define M_0       SCI0CR11.SCICR1_BITS._M      
#define RSRC_0    SCI0CR11.SCICR1_BITS._RSRC     
#define SCISWAI_0 SCI0CR11.SCICR1_BITS._SCISWAI
#define LOOPS_0   SCI0CR11.SCICR1_BITS._LOOPS

/*****SCI 0 CONTROL REGISTER 2*****/
 volatile  SCICR2_TYPE SCI0CR21 _IO_AT(0xCB);                

/*DEFINE REGISTER*/                          
#define SCI0CR2 SCI0CR21.SCICR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SBK_0  SCI0CR21.SCICR2_BITS._SBK      
#define RWU_0  SCI0CR21.SCICR2_BITS._RWU     
#define RE_0   SCI0CR21.SCICR2_BITS._RE       
#define TE_0   SCI0CR21.SCICR2_BITS._TE      
#define ILIE_0 SCI0CR21.SCICR2_BITS._ILIE      
#define RIE_0  SCI0CR21.SCICR2_BITS._RIE     
#define TCIE_0 SCI0CR21.SCICR2_BITS._TCIE
#define TIE_0  SCI0CR21.SCICR2_BITS._TIE

/*******************************************************************************************/
/*                                   SCI STATUS REGISTERS 0                                */
/*******************************************************************************************/

/*****SCI 0 STATUS REGISTER 1*****/
 volatile  SCISR1_TYPE SCI0SR11 _IO_AT(0xCC);                

/*DEFINE REGISTER*/                          
#define SCI0SR1 SCI0SR11.SCISR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PF_0   SCI0SR11.SCISR1_BITS._PF      
#define FE_0   SCI0SR11.SCISR1_BITS._FE     
#define NF_0   SCI0SR11.SCISR1_BITS._NF       
#define OR_0   SCI0SR11.SCISR1_BITS._OR      
#define IDLE_0 SCI0SR11.SCISR1_BITS._IDLE      
#define RDRF_0 SCI0SR11.SCISR1_BITS._RDRF     
#define TC_0   SCI0SR11.SCISR1_BITS._TC
#define TDRE_0 SCI0SR11.SCISR1_BITS._TDRE

/*****SCI 0 STATUS REGISTER 2*****/
 volatile  SCISR2_TYPE SCI0SR21 _IO_AT(0xCD);                

/*DEFINE REGISTER*/                          
#define SCI0SR2 SCI0SR21.SCISR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RAF_0 SCI0SR21.SCISR2_BITS._RAF      

/*******************************************************************************************/
/*                                   SCI DATA REGISTERS 0                                  */
/*******************************************************************************************/

/*****SCI DATA REGISTER 0 HIGH*****/
 volatile  SCIDRH_TYPE SCI0DRH1 _IO_AT(0xCE);                

/*DEFINE REGISTER*/                          
#define SCI0DRH SCI0DRH1.SCIDRH_BYTE            

/*DEFINE REGISTER BITS*/                     
#define T8_0 SCI0DRH1.SCIDRH_BITS._T8
#define R8_0 SCI0DRH1.SCIDRH_BITS._R8


/*****SCI DATA REGISTER 0 LOW*****/
 volatile  unsigned char SCI0DRL    _IO_AT(0xCF);  

/*******************************************************************************************/
/*                            SCI BAUD RATE CONTROL REGISTERS 1                            */
/*******************************************************************************************/

