SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/*****SCI BAUD RATE CONTROL REGISTER 1 HIGH*****/
 volatile  SCIBDH_TYPE SCI1BDH1 _IO_AT(0xD0);                

/*DEFINE REGISTER*/                          
#define SCI1BDH SCI1BDH1.SCIBDH_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SBR8_1  SCI1BDH1.SCIBDH_BITS._SBR8
#define SBR9_1  SCI1BDH1.SCIBDH_BITS._SBR9     
#define SBR10_1 SCI1BDH1.SCIBDH_BITS._SBR10       
#define SBR11_1 SCI1BDH1.SCIBDH_BITS._SBR11      
#define SBR12_1 SCI1BDH1.SCIBDH_BITS._SBR12      

/*****SCI BAUD RATE CONTROL REGISTER 1 LOW*****/
 volatile  SCIBDL_TYPE SCI1BDL1 _IO_AT(0xD1);                

/*DEFINE REGISTER*/                          
#define SCI1BDL SCI1BDL1.SCIBDL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SBR0_1 SCI1BDL1.SCIBDL_BITS._SBR0       
#define SBR1_1 SCI1BDL1.SCIBDL_BITS._SBR1    
#define SBR2_1 SCI1BDL1.SCIBDL_BITS._SBR2       
#define SBR3_1 SCI1BDL1.SCIBDL_BITS._SBR3      
#define SBR4_1 SCI1BDL1.SCIBDL_BITS._SBR4      
#define SBR5_1 SCI1BDL1.SCIBDL_BITS._SBR5    
#define SBR6_1 SCI1BDL1.SCIBDL_BITS._SBR6
#define SBR7_1 SCI1BDL1.SCIBDL_BITS._SBR7

/*******************************************************************************************/
/*                                 SCI 1 CONTROL REGISTERS                                 */
/*******************************************************************************************/

/*****SCI 1 CONTROL REGISTER 1*****/
 volatile  SCICR1_TYPE SCI1CR11 _IO_AT(0xD2);                

/*DEFINE REGISTER*/                          
#define SCI1CR1 SCI1CR11.SCICR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PT_1      SCI1CR11.SCICR1_BITS._PT      
#define PE_1      SCI1CR11.SCICR1_BITS._PE     
#define ILT_1     SCI1CR11.SCICR1_BITS._ILT       
#define WAKE_1    SCI1CR11.SCICR1_BITS._WAKE      
#define M_1       SCI1CR11.SCICR1_BITS._M      
#define RSRC_1    SCI1CR11.SCICR1_BITS._RSRC     
#define SCISWAI_1 SCI1CR11.SCICR1_BITS._SCISWAI
#define LOOPS_1   SCI1CR11.SCICR1_BITS._LOOPS

/*****SCI 1 CONTROL REGISTER 2*****/
 volatile  SCICR2_TYPE SCI1CR21 _IO_AT(0xD3);                

/*DEFINE REGISTER*/                          
#define SCI1CR2 SCI1CR21.SCICR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SBK_1  SCI1CR21.SCICR2_BITS._SBK      
#define RWU_1  SCI1CR21.SCICR2_BITS._RWU     
#define RE_1   SCI1CR21.SCICR2_BITS._RE       
#define TE_1   SCI1CR21.SCICR2_BITS._TE      
#define ILIE_1 SCI1CR21.SCICR2_BITS._ILIE      
#define RIE_1  SCI1CR21.SCICR2_BITS._RIE     
#define TCIE_1 SCI1CR21.SCICR2_BITS._TCIE
#define TIE_1  SCI1CR21.SCICR2_BITS._TIE

/*******************************************************************************************/
/*                                   SCI STATUS REGISTERS 1                                */
/*******************************************************************************************/

/*****SCI 1 STATUS REGISTER 1*****/
 volatile  SCISR1_TYPE SCI1SR11 _IO_AT(0xD4);                

/*DEFINE REGISTER*/                          
#define SCI1SR1 SCI1SR11.SCISR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define PF_1   SCI1SR11.SCISR1_BITS._PF      
#define FE_1   SCI1SR11.SCISR1_BITS._FE     
#define NF_1   SCI1SR11.SCISR1_BITS._NF       
#define OR_1   SCI1SR11.SCISR1_BITS._OR      
#define IDLE_1 SCI1SR11.SCISR1_BITS._IDLE      
#define RDRF_1 SCI1SR11.SCISR1_BITS._RDRF     
#define TC_1   SCI1SR11.SCISR1_BITS._TC
#define TDRE_1 SCI1SR11.SCISR1_BITS._TDRE

/*****SCI 1 STATUS REGISTER 2*****/
 volatile  SCISR2_TYPE SCI1SR21 _IO_AT(0xD5);                

/*DEFINE REGISTER*/                          
#define SCI1SR2 SCI1SR21.SCISR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RAF_1 SCI1SR21.SCISR2_BITS._RAF      

/*******************************************************************************************/
/*                                   SCI DATA REGISTERS 1                                  */
/*******************************************************************************************/

/*****SCI DATA REGISTER 1 HIGH*****/
 volatile  SCIDRH_TYPE SCI1DRH1 _IO_AT(0xD6);                

/*DEFINE REGISTER*/                          
#define SCI1DRH SCI1DRH1.SCIDRH_BYTE            

/*DEFINE REGISTER BITS*/                     
#define T8_1 SCI1DRH1.SCIDRH_BITS._T8
#define R8_1 SCI1DRH1.SCIDRH_BITS._R8


/*****SCI DATA REGISTER 1 LOW*****/
 volatile  unsigned char SCI1DRL    _IO_AT(0xD7);  

/*******************************************************************************************/
/*                                 SPI REGISTERS STRUCTURE                                 */
/*******************************************************************************************/

/*****SPI CONTROL REGISTER 1*****/
typedef  union {                            
  struct {                             
    unsigned char _LSBF:1;               
    unsigned char _SSOE:1;              
    unsigned char _CPHA:1;               
    unsigned char _CPOL:1;              
    unsigned char _MSTR:1;               
    unsigned char _SPTIE:1;               
    unsigned char _SPE:1;               
    unsigned char _SPIE:1;                
  } SPICR1_BITS;                       
  unsigned char SPICR1_BYTE;                 
} SPICR1_TYPE;                

/*****SPI 0 CONTROL REGISTER 2*****/
typedef  union {                            
  struct {                             
    unsigned char _SPC0:1;               
    unsigned char _SPISWAI:1;              
    unsigned char BIT2:1;               
    unsigned char _BIDIROE:1;              
    unsigned char _MODFEN:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } SPICR2_BITS;                       
  unsigned char SPICR2_BYTE;                 
} SPICR2_TYPE;                

/*****SPI BAUD RATE REGISTER *****/
typedef  union {                            
  struct {                             
    unsigned char _SPR0:1;               
    unsigned char _SPR1:1;              
    unsigned char _SPR2:1;               
    unsigned char BIT3:1;              
    unsigned char _SPPR0:1;               
    unsigned char _SPPR1:1;               
    unsigned char _SPPR2:1;               
    unsigned char BIT7:1;                
  } SPIBR_BITS;                       
  unsigned char SPIBR_BYTE;                 
} SPIBR_TYPE;                

/*****SPI STATUS REGISTER *****/
typedef  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1;               
    unsigned char BIT3:1;              
    unsigned char _MODF:1;               
    unsigned char _SPTEF:1;               
    unsigned char BIT6:1;               
    unsigned char _SPIF:1;                    
  } SPISR_BITS;                       
  unsigned char SPISR_BYTE;                 
} SPISR_TYPE;

/*******************************************************************************************/
/*                                 SPI 0 CONTROL REGISTERS                                 */
/*******************************************************************************************/

/*****SPI CONTROL REGISTER 1*****/
 volatile  SPICR1_TYPE SPI0CR11 _IO_AT(0xD8);                

/*DEFINE REGISTER*/                          
#define SPI0CR1 SPI0CR11.SPICR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define LSBF_0  SPI0CR11.SPICR1_BITS._LSBF      
#define SSOE_0  SPI0CR11.SPICR1_BITS._SSOE     
#define CPHA_0  SPI0CR11.SPICR1_BITS._CPHA       
#define CPOL_0  SPI0CR11.SPICR1_BITS._CPOL      
#define MSTR_0  SPI0CR11.SPICR1_BITS._MSTR      
#define SPTIE_0 SPI0CR11.SPICR1_BITS._SPTIE     
#define SPE_0   SPI0CR11.SPICR1_BITS._SPE
#define SPIE_0  SPI0CR11.SPICR1_BITS._SPIE

/*****SPI 0 CONTROL REGISTER 2*****/
 volatile  SPICR2_TYPE SPI0CR21 _IO_AT(0xD9);                

/*DEFINE REGISTER*/                          
#define SPI0CR2 SPI0CR21.SPICR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SPC0_0    SPI0CR21.SPICR2_BITS._SPC0      
#define SPISWAI_0 SPI0CR21.SPICR2_BITS._SPISWAI     
#define BIDIROE_0 SPI0CR21.SPICR2_BITS._BIDIROE     
#define MODFEN_0  SPI0CR21.SPICR2_BITS._MODFEN     

/*******************************************************************************************/
/*                                SPI 0 BAUD RATE REGISTER                                 */
/*******************************************************************************************/
 volatile  SPIBR_TYPE SPI0BR1 _IO_AT(0xDA);                

/*DEFINE REGISTER*/                          
#define SPI0BR SPI0BR1.SPIBR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SPR0_0  SPI0BR1.SPIBR_BITS._SPR0      
#define SPR1_0  SPI0BR1.SPIBR_BITS._SPR1     
#define SPR2_0  SPI0BR1.SPIBR_BITS._SPR2      
#define SPPR0_0 SPI0BR1.SPIBR_BITS._SPPR0      
#define SPPR1_0 SPI0BR1.SPIBR_BITS._SPPR1     
#define SPPR2_0 SPI0BR1.SPIBR_BITS._SPPR2      

/*******************************************************************************************/
/*                                   SPI 0 STATUS REGISTER                                 */
/*******************************************************************************************/
 volatile  SPISR_TYPE SPI0SR1 _IO_AT(0xDB);                

/*DEFINE REGISTER*/                          
#define SPI0SR SPI0SR1.SPISR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define MODF_0  SPI0SR1.SPISR_BITS._MODF     
#define SPTEF_0 SPI0SR1.SPISR_BITS._SPTEF
#define SPIF_0  SPI0SR1.SPISR_BITS._SPIF

/*******************************************************************************************/
/*                                  SPI 0 DATA REGISTERS                                   */
/*******************************************************************************************/
 volatile  unsigned char SPI0DR    _IO_AT(0xDD);  

/*******************************************************************************************/
/*                                 SPI 1 CONTROL REGISTERS                                 */
/*******************************************************************************************/

/*****SPI CONTROL REGISTER 1*****/
 volatile  SPICR1_TYPE SPI1CR11 _IO_AT(0xF0);                

/*DEFINE REGISTER*/                          
#define SPI1CR1 SPI1CR11.SPICR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define LSBF_1  SPI1CR11.SPICR1_BITS._LSBF      
#define SSOE_1  SPI1CR11.SPICR1_BITS._SSOE     
#define CPHA_1  SPI1CR11.SPICR1_BITS._CPHA       
#define CPOL_1  SPI1CR11.SPICR1_BITS._CPOL      
#define MSTR_1  SPI1CR11.SPICR1_BITS._MSTR      
#define SPTIE_1 SPI1CR11.SPICR1_BITS._SPTIE     
#define SPE_1   SPI1CR11.SPICR1_BITS._SPE
#define SPIE_1  SPI1CR11.SPICR1_BITS._SPIE

/*****SPI 1 CONTROL REGISTER 2*****/
 volatile  SPICR2_TYPE SPI1CR21 _IO_AT(0xF1);                

/*DEFINE REGISTER*/                          
#define SPI1CR2 SPI1CR21.SPICR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SPC0_1    SPI1CR21.SPICR2_BITS._SPC0      
#define SPISWAI_1 SPI1CR21.SPICR2_BITS._SPISWAI     
#define BIDIROE_1 SPI1CR21.SPICR2_BITS._BIDIROE     
#define MODFEN_1  SPI1CR21.SPICR2_BITS._MODFEN     

/*******************************************************************************************/
/*                                SPI 1 BAUD RATE REGISTER                                 */
/*******************************************************************************************/
 volatile  SPIBR_TYPE SPI1BR1 _IO_AT(0xF2);                

/*DEFINE REGISTER*/                          
#define SPI1BR SPI1BR1.SPIBR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SPR0_1  SPI1BR1.SPIBR_BITS._SPR0      
#define SPR1_1  SPI1BR1.SPIBR_BITS._SPR1     
#define SPR2_1  SPI1BR1.SPIBR_BITS._SPR2      
#define SPPR0_1 SPI1BR1.SPIBR_BITS._SPPR0      
#define SPPR1_1 SPI1BR1.SPIBR_BITS._SPPR1     
#define SPPR2_1 SPI1BR1.SPIBR_BITS._SPPR2      

/*******************************************************************************************/
/*                                   SPI 1 STATUS REGISTER                                 */
/*******************************************************************************************/
 volatile  SPISR_TYPE SPI1SR1 _IO_AT(0xF3);                

/*DEFINE REGISTER*/                          
#define SPI1SR SPI1SR1.SPISR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define MODF_1  SPI1SR1.SPISR_BITS._MODF     
#define SPTEF_1 SPI1SR1.SPISR_BITS._SPTEF
#define SPIF_1  SPI1SR1.SPISR_BITS._SPIF

/*******************************************************************************************/
/*                                  SPI 1 DATA REGISTERS                                   */
/*******************************************************************************************/
 volatile  unsigned char SPI1DR    _IO_AT(0xF5);  

/*******************************************************************************************/
/*                                 SPI 2 CONTROL REGISTERS                                 */
/*******************************************************************************************/

/*****SPI CONTROL REGISTER 1*****/
 volatile  SPICR1_TYPE SPI2CR11 _IO_AT(0xF8);                

/*DEFINE REGISTER*/                          
#define SPI2CR1 SPI2CR11.SPICR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define LSBF_2  SPI2CR11.SPICR1_BITS._LSBF      
#define SSOE_2  SPI2CR11.SPICR1_BITS._SSOE     
#define CPHA_2  SPI2CR11.SPICR1_BITS._CPHA       
#define CPOL_2  SPI2CR11.SPICR1_BITS._CPOL      
#define MSTR_2  SPI2CR11.SPICR1_BITS._MSTR      
#define SPTIE_2 SPI2CR11.SPICR1_BITS._SPTIE     
#define SPE_2   SPI2CR11.SPICR1_BITS._SPE
#define SPIE_2  SPI2CR11.SPICR1_BITS._SPIE

/*****SPI 2 CONTROL REGISTER 2*****/
 volatile  SPICR2_TYPE SPI2CR21 _IO_AT(0xF9);                

/*DEFINE REGISTER*/                          
#define SPI2CR2 SPI2CR21.SPICR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SPC0_2    SPI2CR21.SPICR2_BITS._SPC0      
#define SPISWAI_2 SPI2CR21.SPICR2_BITS._SPISWAI     
#define BIDIROE_2 SPI2CR21.SPICR2_BITS._BIDIROE     
#define MODFEN_2  SPI2CR21.SPICR2_BITS._MODFEN     

/*******************************************************************************************/
/*                                SPI 2 BAUD RATE REGISTER                                 */
/*******************************************************************************************/
 volatile  SPIBR_TYPE SPI2BR1 _IO_AT(0xFA);                

/*DEFINE REGISTER*/                          
#define SPI2BR SPI2BR1.SPIBR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SPR0_2  SPI2BR1.SPIBR_BITS._SPR0      
#define SPR1_2  SPI2BR1.SPIBR_BITS._SPR1     
#define SPR2_2  SPI2BR1.SPIBR_BITS._SPR2      
#define SPPR0_2 SPI2BR1.SPIBR_BITS._SPPR0      
#define SPPR1_2 SPI2BR1.SPIBR_BITS._SPPR1     
#define SPPR2_2 SPI2BR1.SPIBR_BITS._SPPR2      

/*******************************************************************************************/
/*                                   SPI 2 STATUS REGISTER                                 */
/*******************************************************************************************/
 volatile  SPISR_TYPE SPI2SR1 _IO_AT(0xFB);                

/*DEFINE REGISTER*/                          
#define SPI2SR SPI2SR1.SPISR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define MODF_2  SPI2SR1.SPISR_BITS._MODF     
#define SPTEF_2 SPI2SR1.SPISR_BITS._SPTEF
#define SPIF_2  SPI2SR1.SPISR_BITS._SPIF

/*******************************************************************************************/
/*                                  SPI 2 DATA REGISTERS                                   */
/*******************************************************************************************/
 volatile  unsigned char SPI2DR    _IO_AT(0xFD);  

/*******************************************************************************************/
/*                                    IIC BUS ADDRESS REGISTER                             */
/*******************************************************************************************/
 volatile  unsigned char IBAD    _IO_AT(0xE0);  

/*******************************************************************************************/
/*                          IIC BUS FREQUENCY DIVIDER REGISTER                             */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _IBC0:1;               
    unsigned char _IBC1:1;              
    unsigned char _IBC2:1;              
    unsigned char _IBC3:1;             
    unsigned char _IBC4:1;               
    unsigned char _IBC5:1;              
    unsigned char _IBC6:1;               
    unsigned char _IBC7:1;                    
  } IBFD_BITS;                       
  unsigned char IBFD_BYTE;                 
} IBFD1 _IO_AT(0xE1);                

/*DEFINE REGISTER*/                          
#define IBFD IBFD1.IBFD_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IBC0 IBFD1.IBFD_BITS._IBC0     
#define IBC1 IBFD1.IBFD_BITS._IBC1     
#define IBC2 IBFD1.IBFD_BITS._IBC2  
#define IBC3 IBFD1.IBFD_BITS._IBC3  
#define IBC4 IBFD1.IBFD_BITS._IBC4  
#define IBC5 IBFD1.IBFD_BITS._IBC5  
#define IBC6 IBFD1.IBFD_BITS._IBC6  
#define IBC7 IBFD1.IBFD_BITS._IBC7  

/*******************************************************************************************/
/*                              IIC BUS CONTROL REGISTER                                   */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _IBSWAI:1;               
    unsigned char BIT1:1;              
    unsigned char _RSTA:1;              
    unsigned char _TXAK:1 ;            
    unsigned char TX_RX_1:1;               
    unsigned char MS_SL_1:1;             
    unsigned char _IBIE:1  ;            
    unsigned char _IBEN:1  ;                
  } IBCR_BITS;                       
  unsigned char IBCR_BYTE;                 
} IBCR1 _IO_AT(0xE2);                

/*DEFINE REGISTER*/                          
#define IBCR IBCR1.IBCR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IBSWAI IBCR1.IBCR_BITS._IBSWAI     
#define RSTA   IBCR1.IBCR_BITS._RSTA     
#define TXAK   IBCR1.IBCR_BITS._TXAK  
#define TX_RX_ IBCR1.IBCR_BITS.TX_RX_1  
#define MS_SL_ IBCR1.IBCR_BITS.MS_SL_1  
#define IBIE   IBCR1.IBCR_BITS._IBIE  
#define IBEN   IBCR1.IBCR_BITS._IBEN 

/*******************************************************************************************/
/*                              IIC BUS CONTROL REGISTER                                   */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _RXAK:1;               
    unsigned char _IBIF:1;              
    unsigned char _SRW:1   ;               
    unsigned char _BIT3:1  ;             
    unsigned char _IBAL:1  ;              
    unsigned char _IBB:1   ;           
    unsigned char _IAAS:1  ;             
    unsigned char _TCF:1   ;                 
  } IBSR_BITS;                       
  unsigned char IBSR_BYTE;                 
} IBSR1 _IO_AT(0xE3);                

/*DEFINE REGISTER*/                          
#define IBSR IBSR1.IBSR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RXAK IBSR1.IBSR_BITS._RXAK     
#define IBIF IBSR1.IBSR_BITS._IBIF   
#define SRW  IBSR1.IBSR_BITS._SRW   
#define IBAL IBSR1.IBSR_BITS._IBAL     
#define IBB  IBSR1.IBSR_BITS._IBB   
#define IAAS IBSR1.IBSR_BITS._IAAS   
#define TCF  IBSR1.IBSR_BITS._TCF   

