SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                              IIC BUS DATA I\O REGISTER                                         */
/**************************************************************************************************/    
 volatile  unsigned char  IICDR    _IO_AT(0xE4);                                             

/*******************************************************************************************/
/*                                                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _WCM:1;               
    unsigned char _IE:1;              
    unsigned char BIT2:1   ;               
    unsigned char BIT3:1  ;             
    unsigned char BIT4:1  ;              
    unsigned char BIT5:1   ;           
    unsigned char _CLKS:1  ;             
    unsigned char _IMSG:1   ;                 
  } DLCBCR1_BITS;                       
  unsigned char DLCBCR1_BYTE;                 
} DLCBCR11 _IO_AT(0xE8);                

/*DEFINE REGISTER*/                          
#define DLCBCR1 DLCBCR11.DLCBCR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define WCM  DLCBCR11.DLCBCR1_BITS._WCM     
#define IE   DLCBCR11.DLCBCR1_BITS._IE   
#define CLKS DLCBCR11.DLCBCR1_BITS._CLKS   
#define IMSG DLCBCR11.DLCBCR1_BITS._IMSG     
 
/*******************************************************************************************/
/*                                                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char _I0:1   ;               
    unsigned char _I1:1  ;             
    unsigned char _I2:1  ;              
    unsigned char _I3:1   ;           
    unsigned char BIT6:1  ;             
    unsigned char BIT7:1   ;                 
  } DLCBSVR_BITS;                       
  unsigned char DLCBSVR_BYTE;                 
} DLCBSVR1 _IO_AT(0xE9);                

/*DEFINE REGISTER*/                          
#define DLCBSVR DLCBSVR1.DLCBSVR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define I0 DLCBSVR1.DLCBSVR_BITS._I0     
#define I1 DLCBSVR1.DLCBSVR_BITS._I1   
#define I2 DLCBSVR1.DLCBSVR_BITS._I2   
#define I3 DLCBSVR1.DLCBSVR_BITS._I3     
 
/*******************************************************************************************/
/*                                                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _TMIFR0:1;               
    unsigned char _TMIFR1:1;              
    unsigned char _TSIFR:1   ;               
    unsigned char _TEOD:1  ;             
    unsigned char _NBFS:1  ;              
    unsigned char _RX4XE:1   ;           
    unsigned char _DLOOP:1  ;             
    unsigned char _SMRST:1   ;                 
  } DLCBCR2_BITS;                       
  unsigned char DLCBCR2_BYTE;                 
} DLCBCR21 _IO_AT(0xEA);                

/*DEFINE REGISTER*/                          
#define DLCBCR2 DLCBCR21.DLCBCR2_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TMIFR0 DLCBCR21.DLCBCR2_BITS._TMIFR0     
#define TMIFR1 DLCBCR21.DLCBCR2_BITS._TMIFR1   
#define TSIFR  DLCBCR21.DLCBCR2_BITS._TSIFR   
#define TEOD   DLCBCR21.DLCBCR2_BITS._TEOD     
#define NBFS   DLCBCR21.DLCBCR2_BITS._NBFS     
#define RX4XE  DLCBCR21.DLCBCR2_BITS._RX4XE   
#define DLOOP  DLCBCR21.DLCBCR2_BITS._DLOOP   
#define SMRST  DLCBCR21.DLCBCR2_BITS._SMRST     
 
/*******************************************************************************************/
/*                                                                     */
/*******************************************************************************************/
 volatile  unsigned char DLCBDR    _IO_AT(0xEB);  

/*******************************************************************************************/
/*                                                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _BO0:1;               
    unsigned char _BO1:1;              
    unsigned char _BO2:1   ;               
    unsigned char _BO3:1  ;             
    unsigned char BIT4:1  ;              
    unsigned char BIT5:1   ;           
    unsigned char _RXPOL:1  ;             
    unsigned char BIT7:1   ;                 
  } DLCBARD_BITS;                       
  unsigned char DLCBARD_BYTE;                 
} DLCBARD1 _IO_AT(0xEC);                

/*DEFINE REGISTER*/                          
#define DLCBARD DLCBARD1.DLCBARD_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BO0   DLCBARD1.DLCBARD_BITS._BO0     
#define BO1   DLCBARD1.DLCBARD_BITS._BO1   
#define BO2   DLCBARD1.DLCBARD_BITS._BO2   
#define BO3   DLCBARD1.DLCBARD_BITS._BO3     
#define RXPOL DLCBARD1.DLCBARD_BITS._RXPOL     
 
/*******************************************************************************************/
/*                                                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _R0:1;               
    unsigned char _R1:1;              
    unsigned char _R2:1   ;               
    unsigned char _R3:1  ;             
    unsigned char _R4:1  ;              
    unsigned char _R5:1   ;           
    unsigned char BIT6:1  ;             
    unsigned char BIT7:1   ;                 
  } DLCBRSR_BITS;                       
  unsigned char DLCBRSR_BYTE;                 
} DLCBRSR1 _IO_AT(0xED);                

/*DEFINE REGISTER*/                          
#define DLCBRSR DLCBRSR1.DLCBRSR_BYTE            

/*DEFINE REGISTER BITS*/                     
#define R0 DLCBRSR1.DLCBRSR_BITS._R0     
#define R1 DLCBRSR1.DLCBRSR_BITS._R1   
#define R2 DLCBRSR1.DLCBRSR_BITS._R2   
#define R3 DLCBRSR1.DLCBRSR_BITS._R3     
#define R4 DLCBRSR1.DLCBRSR_BITS._R4     
#define R5 DLCBRSR1.DLCBRSR_BITS._R5     

/*******************************************************************************************/
/*                                                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1   ;               
    unsigned char BIT3:1  ;             
    unsigned char _BDLCE:1  ;              
    unsigned char BIT5:1   ;           
    unsigned char BIT6:1  ;             
    unsigned char BIT7:1   ;                 
  } DLCSRC_BITS;                       
  unsigned char DLCSRC_BYTE;                 
} DLCSRC1 _IO_AT(0xEE);                

/*DEFINE REGISTER*/                          
#define DLCSRC DLCSRC1.DLCSRC_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BDLCE DLCSRC1.DLCSRC_BITS._BDLCE     

/*******************************************************************************************/
/*                                                                 */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _IDLE:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1   ;               
    unsigned char BIT3:1  ;             
    unsigned char BIT4:1  ;              
    unsigned char BIT5:1   ;           
    unsigned char BIT6:1  ;             
    unsigned char BIT7:1   ;                 
  } DLCBSTAT_BITS;                       
  unsigned char DLCBSTAT_BYTE;                 
} DLCBSTAT1 _IO_AT(0xEF);                

/*DEFINE REGISTER*/                          
#define DLCBSTAT DLCBSTAT1.DLCBSTAT_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IDLE_Condition DLCBSTAT1.DLCBSTAT_BITS._IDLE     

/*******************************************************************************************/
/*                             FLASH CLOCK DIVIDER REGISTER.                               */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _FDIV0:1;               
    unsigned char _FDIV1:1;              
    unsigned char _FDIV2:1;               
    unsigned char _FDIV3:1;              
    unsigned char _FDIV4:1;               
    unsigned char _FDIV5:1;               
    unsigned char _FDIV8:1;               
    unsigned char _FDIVLD:1;                
  } FCLKDIV_BITS;                       
  unsigned char FCLKDIV_BYTE;                 
} FCLKDIV1 _IO_AT(0x100);                

/*DEFINE REGISTER*/                          
#define FCLKDIV FCLKDIV1.FCLKDIV_BYTE            

/*DEFINE REGISTER BITS*/                     
#define FDIV0  FCLKDIV1.FCLKDIV_BITS._FDIV0      
#define FDIV1  FCLKDIV1.FCLKDIV_BITS._FDIV1      
#define FDIV2  FCLKDIV1.FCLKDIV_BITS._FDIV2      
#define FDIV3  FCLKDIV1.FCLKDIV_BITS._FDIV3      
#define FDIV4  FCLKDIV1.FCLKDIV_BITS._FDIV4      
#define FDIV5  FCLKDIV1.FCLKDIV_BITS._FDIV5      
#define FDIV8  FCLKDIV1.FCLKDIV_BITS._FDIV8      
#define FDIVLD FCLKDIV1.FCLKDIV_BITS._FDIVLD      

/*******************************************************************************************/
/*                               FLASH SECURITY REGISTER.                                  */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _SEC00:1;               
    unsigned char _SEC01:1;              
    unsigned char _NV2:1;               
    unsigned char _NV3:1;              
    unsigned char _NV4:1;               
    unsigned char _NV5:1;               
    unsigned char _NV6:1;               
    unsigned char _KEYEN:1;                
  } FSEC_BITS;                       
  unsigned char FSEC_BYTE;                 
} FSEC1 _IO_AT(0x101);                

/*DEFINE REGISTER*/                          
#define FSEC FSEC1.FSEC_BYTE            

/*DEFINE REGISTER BITS*/                     
#define SEC00 FSEC1.FSEC_BITS._SEC00      
#define SEC01 FSEC1.FSEC_BITS._SEC01      
#define NV2   FSEC1.FSEC_BITS._NV2      
#define NV3   FSEC1.FSEC_BITS._NV3      
#define NV4   FSEC1.FSEC_BITS._NV4      
#define NV5   FSEC1.FSEC_BITS._NV5      
#define NV6   FSEC1.FSEC_BITS._NV6      
#define KEYEN FSEC1.FSEC_BITS._KEYEN      

/*******************************************************************************************/
/*                             FLASH EEPROM CONFIGURATION REGISTER                         */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char _KEYACC:1;               
    unsigned char _CCIE:1;               
    unsigned char _CBEIE:1;                
  } FCNFG_BITS;                       
  unsigned char FCNFG_BYTE;                 
} FCNFG1 _IO_AT(0x103);                

/*DEFINE REGISTER*/                          
#define FCNFG FCNFG1.FCNFG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define KEYACC FCNFG1.FCNFG_BITS._KEYACC        
#define CCIE   FCNFG1.FCNFG_BITS._CCIE        
#define CBEIE  FCNFG1.FCNFG_BITS._CBEIE        

/*******************************************************************************************/
/*                              FLASH EEPROM PROTECTION REGISTER                           */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _FPLS0:1;               
    unsigned char _FPLS1:1;              
    unsigned char _FPLDIS:1;               
    unsigned char _FPHS0:1;              
    unsigned char _FPHS1:1;               
    unsigned char _FPHDIS:1;               
    unsigned char BIT6:1;               
    unsigned char _FPOPEN:1;                
  } FPROT_BITS;                       
  unsigned char FPROT_BYTE;                 
} FPROT1 _IO_AT(0x104);                

/*DEFINE REGISTER*/                          
#define FPROT FPROT1.FPROT_BYTE            

/*DEFINE REGISTER BITS*/                     
#define FPLS0  FPROT1.FPROT_BITS._FPLS0     
#define FPLS1  FPROT1.FPROT_BITS._FPLS1     
#define FPLDIS FPROT1.FPROT_BITS._FPLDIS      
#define FPHS0  FPROT1.FPROT_BITS._FPHS0      
#define FPHS1  FPROT1.FPROT_BITS._FPHS1      
#define FPHDIS FPROT1.FPROT_BITS._FPHDIS     
#define FPOPEN FPROT1.FPROT_BITS._FPOPEN

/*******************************************************************************************/
/*                                FLASH EEPROM STATUS REGISTER                             */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char _BLANK:1;               
    unsigned char BIT3:1;              
    unsigned char _ACCERR:1;               
    unsigned char _PVIOL:1;               
    unsigned char _CCIF:1;               
    unsigned char _CBEIF:1;                
  } FSTAT_BITS;                       
  unsigned char FSTAT_BYTE;                 
} FSTAT1 _IO_AT(0x105);                

/*DEFINE REGISTER*/                          
#define FSTAT FSTAT1.FSTAT_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BLANK  FSTAT1.FSTAT_BITS._BLANK     
#define ACCERR FSTAT1.FSTAT_BITS._ACCERR     
#define PVIOL  FSTAT1.FSTAT_BITS._PVIOL      
#define CCIF   FSTAT1.FSTAT_BITS._CCIF      
#define CBEIF  FSTAT1.FSTAT_BITS._CBEIF      

/*******************************************************************************************/
/*                            FLASH EEPROM COMMAND BUFFER REGISTER                         */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _MASS:1;               
    unsigned char BIT1:1;              
    unsigned char _ERVR:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char _PROG:1;               
    unsigned char _ERASE:1;               
    unsigned char BIT7:1;                
  } FCMD_BITS;                       
  unsigned char FCMD_BYTE;                 
} FCMD1 _IO_AT(0x106);                

/*DEFINE REGISTER*/                          
#define FCMD FCMD1.FCMD_BYTE            

/*DEFINE REGISTER BITS*/                     
#define MASS  FCMD1.FCMD_BITS._MASS     
#define ERVR  FCMD1.FCMD_BITS._ERVR     
#define PROG  FCMD1.FCMD_BITS._PROG      
#define ERASE FCMD1.FCMD_BITS._ERASE      

/*******************************************************************************************/
/*                               EEPROM CLOCK DIVIDER                                       */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _EDIV0:1;               
    unsigned char _EDIV1:1;              
    unsigned char _EDIV2:1;               
    unsigned char _EDIV3:1;              
    unsigned char _EDIV4:1;               
    unsigned char _EDIV5:1;               
    unsigned char _EDIV6:1;               
    unsigned char _EDIVLD:1;                
  } ECLKDIV_BITS;                       
  unsigned char ECLKDIV_BYTE;                 
} ECLKDIV1 _IO_AT(0x110);                

/*DEFINE REGISTER*/                          
#define ECLKDIV ECLKDIV1.ECLKDIV_BYTE            

/*DEFINE REGISTER BITS*/                     
#define EDIV0  ECLKDIV1.ECLKDIV_BITS._EDIV0      
#define EDIV1  ECLKDIV1.ECLKDIV_BITS._EDIV1      
#define EDIV2  ECLKDIV1.ECLKDIV_BITS._EDIV2      
#define EDIV3  ECLKDIV1.ECLKDIV_BITS._EDIV3      
#define EDIV4  ECLKDIV1.ECLKDIV_BITS._EDIV4      
#define EDIV5  ECLKDIV1.ECLKDIV_BITS._EDIV5      
#define EDIV6  ECLKDIV1.ECLKDIV_BITS._EDIV6      
#define EDIVLD ECLKDIV1.ECLKDIV_BITS._EDIVLD     

/*******************************************************************************************/
/*                                      EEPROM CONFIG                                      */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char BIT2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char _CCIE:1;               
    unsigned char _CBEIE:1;                
  } ECNFG_BITS;                       
  unsigned char ECNFG_BYTE;                 
} ECNFG1 _IO_AT(0x113);                

/*DEFINE REGISTER*/                          
#define ECNFG ECNFG1.ECNFG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define E_CCIE  ECNFG1.ECNFG_BITS._CCIE      
#define E_CBEIE ECNFG1.ECNFG_BITS._CBEIE     

/*******************************************************************************************/
/*                                   EEPROM BLOCK PROTECT                                  */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _EP0:1;               
    unsigned char _EP1:1;              
    unsigned char _EP2:1;               
    unsigned char _EPDIS:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char _EPOPEN:1;                
  } EPROT_BITS;                       
  unsigned char EPROT_BYTE;                 
} EPROT1 _IO_AT(0x114);                

/*DEFINE REGISTER*/                          
#define EPROT EPROT1.EPROT_BYTE            

/*DEFINE REGISTER BITS*/                     
#define EP0    EPROT1.EPROT_BITS._EP0      
#define EP1    EPROT1.EPROT_BITS._EP1     
#define EP2    EPROT1.EPROT_BITS._EP2      
#define EPDIS  EPROT1.EPROT_BITS._EPDIS      
#define EPOPEN EPROT1.EPROT_BITS._EPOPEN      

/*******************************************************************************************/
/*                                      EEPROM STATUS                                      */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char BIT0:1;               
    unsigned char BIT1:1;              
    unsigned char _BLANK:1;               
    unsigned char BIT3:1;              
    unsigned char _ACCERR:1;               
    unsigned char _PVIOL:1;               
    unsigned char _CCIF:1;               
    unsigned char _CBEIF:1;                
  } ESTAT_BITS;                       
  unsigned char ESTAT_BYTE;                 
} ESTAT1 _IO_AT(0x115);                

/*DEFINE REGISTER*/                          
#define ESTAT ESTAT1.ESTAT_BYTE            

/*DEFINE REGISTER BITS*/                     
#define E_BLANK  ESTAT1.ESTAT_BITS._BLANK     
#define E_ACCERR ESTAT1.ESTAT_BITS._ACCERR      
#define E_PVIOL  ESTAT1.ESTAT_BITS._PVIOL      
#define E_CCIF   ESTAT1.ESTAT_BITS._CCIF     
#define E_CBEIF  ESTAT1.ESTAT_BITS._CBEIF

/*******************************************************************************************/
/*                                       EEPROM COMMAND                                    */
/*******************************************************************************************/
 volatile  union {                            
  struct {                             
    unsigned char _MASS:1;               
    unsigned char BIT1:1;              
    unsigned char _ERVR:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char _PROG:1;               
    unsigned char _ERASE:1;               
    unsigned char BIT7:1;                
  } ECMD_BITS;                       
  unsigned char ECMD_BYTE;                 
} ECMD1 _IO_AT(0x116);                

/*DEFINE REGISTER*/                          
#define ECMD ECMD1.ECMD_BYTE            

/*DEFINE REGISTER BITS*/                     
#define E_MASS  ECMD1.ECMD_BITS._MASS       
#define E_ERVR  ECMD1.ECMD_BITS._ERVR     
#define E_PROG  ECMD1.ECMD_BITS._PROG      
#define E_ERASE ECMD1.ECMD_BITS._ERASE      

/*******************************************************************************************/
/*                                MSCAN12 REGISTER STRUCTURE                               */
/*******************************************************************************************/

/**********MSCAN12 MODULE CONTROL REGISTER 0********/
typedef  union {                            
  struct {                             
    unsigned char _INITRQ:1;               
    unsigned char _SLPRQ:1;              
    unsigned char _WUPE:1;               
    unsigned char _TIME:1;              
    unsigned char _SYNCH:1;               
    unsigned char _CSWAI:1;               
    unsigned char _RXACT:1;               
    unsigned char _RXFRM:1;                
  } CANCTL0_BITS;                       
  unsigned char CANCTL0_BYTE;                 
} CANCTL0_TYPE;               

/**********MSCAN12 MODULE CONTROL REGISTER 1********/
typedef  union {                            
  struct {                             
    unsigned char _INITAK:1;               
    unsigned char _SPLACK:1;              
    unsigned char _WUPM:1;               
    unsigned char BIT3:1;              
    unsigned char _LISTEN:1;               
    unsigned char _LOOPB:1;               
    unsigned char _CLKSRC:1;               
    unsigned char _CANE:1;                
  } CANCTL1_BITS;                       
  unsigned char CANCTL1_BYTE;                 
} CANCTL1_TYPE;               

