SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**********MSCAN12 BUS TIMING REGISTER 0********/
typedef  union {                            
  struct {                             
    unsigned char _BRP0:1;               
    unsigned char _BRP1:1;              
    unsigned char _BRP2:1;               
    unsigned char _BRP3:1;              
    unsigned char _BRP4:1;               
    unsigned char _BRP5:1;               
    unsigned char _SJW0:1;               
    unsigned char _SJW1:1;                
  } CANBTR0_BITS;                       
  unsigned char CANCBTR0_BYTE;                 
} CANBTR0_TYPE;               

/**********MSCAN12 BUS TIMING REGISTER 1 ********/
typedef  union {                            
  struct {                             
    unsigned char _TSEG10:1;               
    unsigned char _TSEG11:1;              
    unsigned char _TSEG12:1;               
    unsigned char _TSEG13:1;              
    unsigned char _TSEG20:1;               
    unsigned char _TSEG21:1;               
    unsigned char _TSEG22:1;               
    unsigned char _SAMP:1;                
  } CANBTR1_BITS;                       
  unsigned char CANBTR1_BYTE;                 
} CANBTR1_TYPE;               

/**********MSCAN12 RECEIVER FLAG REGISTER ********/
typedef  union {                            
  struct {                             
    unsigned char _RFX:1;               
    unsigned char _OVRIF:1;              
    unsigned char _TSTAT0:1;               
    unsigned char _TSTAT1:1;              
    unsigned char _RSTAT0:1;               
    unsigned char _RSTAT1:1;               
    unsigned char _CSCIF:1;               
    unsigned char _WUPIF:1;                
  } CANRFLG_BITS;                       
  unsigned char CANRFLG_BYTE;                 
} CANRFLG_TYPE;               

/**********MSCAN12 RECEIVER INTERRUPT ENABLE REGISTER ********/
typedef  union {                            
  struct {                             
    unsigned char _RFXIE:1;               
    unsigned char _OVRIE:1;              
    unsigned char _TSTATE0:1;               
    unsigned char _TSTATE1:1;              
    unsigned char _RSTATE0:1;               
    unsigned char _RSTATE1:1;               
    unsigned char _CSCIE:1;               
    unsigned char _WUPIE:1;                
  } CANRIER_BITS;                       
  unsigned char CANRIER_BYTE;                 
} CANRIER_TYPE;               

/**********MSCAN12 TRANSMITTER FLAG REGISTER ********/
typedef  union {                            
  struct {                             
    unsigned char _TXE0:1;               
    unsigned char _TXE1:1;              
    unsigned char _TXE2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } CANTFLG_BITS;                       
  unsigned char CANTFLG_BYTE;                 
} CANTFLG_TYPE;               

/**********MSCAN12 TRANSMITTER CONTROL REGISTER ********/
typedef  union {                            
  struct {                             
    unsigned char _TXEIE0:1;               
    unsigned char _TXEIE1:1;              
    unsigned char _TXEIE2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } CANTIER_BITS;                       
  unsigned char CANTIER_BYTE;                 
} CANTIER_TYPE;               

/**********MSCAN12 IDENTIFIER ACCEPTANCE CONTROL REGISTER ********/
typedef  union {                            
  struct {                             
    unsigned char _ABTRQ0:1;               
    unsigned char _ABTRQ1:1;              
    unsigned char _ABTRQ2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } CANTARQ_BITS;                       
  unsigned char CANTARQ_BYTE;                 
} CANTARQ_TYPE;               

/**********    ********/
typedef  union {                            
  struct {                             
    unsigned char _ABTAK0:1;               
    unsigned char _ABTAK1:1;              
    unsigned char _ABTAK2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } CANTAAK_BITS;                       
  unsigned char CANTAAK_BYTE;                 
} CANTAAK_TYPE;               

/**********    ********/
typedef  union {                            
  struct {                             
    unsigned char _TX0:1;               
    unsigned char _TX1:1;              
    unsigned char _TX2:1;               
    unsigned char BIT3:1;              
    unsigned char BIT4:1;               
    unsigned char BIT5:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } CANTBSEL_BITS;                       
  unsigned char CANTBSEL_BYTE;                 
} CANTBSEL_TYPE;               

/**********    ********/
typedef union {
  struct {                             
    unsigned char _IDHI0:1;               
    unsigned char _IDHI1:1;              
    unsigned char _IDJIT2:1;               
    unsigned char BIT3:1;              
    unsigned char _IDAM0:1;               
    unsigned char _IDAM1:1;               
    unsigned char BIT6:1;               
    unsigned char BIT7:1;                
  } CANIDAC_BITS;                       
  unsigned char CANIDAC_BYTE;                 
} CANIDAC_TYPE;  
             
/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 0                           */                                
/*******************************************************************************************/
 volatile  CANCTL0_TYPE CAN0CTL01 _IO_AT(0x140);               

/*DEFINE REGISTER*/                          
#define CAN0CTL0 CAN0CTL01.CANCTL0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITRQ_0 CAN0CTL01.CANCTL0_BITS._INITRQ       
#define SLPRQ_0  CAN0CTL01.CANCTL0_BITS._SLPRQ
#define WUPE_0   CAN0CTL01.CANCTL0_BITS._WUPE 
#define TIME_0   CAN0CTL01.CANCTL0_BITS._TIME       
#define SYNCH_0  CAN0CTL01.CANCTL0_BITS._SYNCH 
#define CSWAI_0  CAN0CTL01.CANCTL0_BITS._CSWAI 
#define RXACT_0  CAN0CTL01.CANCTL0_BITS._RXACT 
#define RXFRM_0  CAN0CTL01.CANCTL0_BITS._RXFRM 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 1                           */
/*******************************************************************************************/
 volatile  CANCTL1_TYPE CAN0CTL11 _IO_AT(0x141);               

/*DEFINE REGISTER*/                          
#define CAN0CTL1 CAN0CTL11.CANCTL1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITAK_0 CAN0CTL11.CANCTL1_BITS._INITAK      
#define SPLACK_0 CAN0CTL11.CANCTL1_BITS._SPLACK      
#define WUPM_0   CAN0CTL11.CANCTL1_BITS._WUPM
#define LISTEN_0 CAN0CTL11.CANCTL1_BITS._LISTEN      
#define LOOPB_0  CAN0CTL11.CANCTL1_BITS._LOOPB
#define CLKSRC_0 CAN0CTL11.CANCTL1_BITS._CLKSRC      
#define CANE_0   CAN0CTL11.CANCTL1_BITS._CANE      

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 0                             */
/*******************************************************************************************/
 volatile  CANBTR0_TYPE CAN0BTR01 _IO_AT(0x142);               

/*DEFINE REGISTER*/                          
#define CAN0BTR0 CAN0BTR01.CANCBTR0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BRP0_0 CAN0BTR01.CANBTR0_BITS._BRP0      
#define BRP1_0 CAN0BTR01.CANBTR0_BITS._BRP1      
#define BRP2_0 CAN0BTR01.CANBTR0_BITS._BRP2      
#define BRP3_0 CAN0BTR01.CANBTR0_BITS._BRP3      
#define BRP4_0 CAN0BTR01.CANBTR0_BITS._BRP4      
#define BRP5_0 CAN0BTR01.CANBTR0_BITS._BRP5      
#define SJW0_0 CAN0BTR01.CANBTR0_BITS._SJW0      
#define SJW1_0 CAN0BTR01.CANBTR0_BITS._SJW1

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 1                             */
/*******************************************************************************************/
 volatile  CANBTR1_TYPE CAN0BTR11 _IO_AT(0x143);               

/*DEFINE REGISTER*/                          
#define CAN0BTR1 CAN0BTR11.CANBTR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TSEG10_0 CAN0BTR11.CANBTR1_BITS._TSEG10    
#define TSEG11_0 CAN0BTR11.CANBTR1_BITS._TSEG11    
#define TSEG12_0 CAN0BTR11.CANBTR1_BITS._TSEG12    
#define TSEG13_0 CAN0BTR11.CANBTR1_BITS._TSEG13    
#define TSEG20_0 CAN0BTR11.CANBTR1_BITS._TSEG20    
#define TSEG21_0 CAN0BTR11.CANBTR1_BITS._TSEG21    
#define TSEG22_0 CAN0BTR11.CANBTR1_BITS._TSEG22    
#define SAMP_0   CAN0BTR11.CANBTR1_BITS._SAMP

/*******************************************************************************************/
/*                               MSCAN12 RECEIVER FLAG REGISTER                            */
/*******************************************************************************************/
 volatile  CANRFLG_TYPE CAN0RFLG1 _IO_AT(0x144);               

/*DEFINE REGISTER*/                          
#define CAN0RFLG CAN0RFLG1.CANRFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFX_0    CAN0RFLG1.CANRFLG_BITS._RFX
#define OVRIF_0  CAN0RFLG1.CANRFLG_BITS._OVRIF  
#define TSTAT0_0 CAN0RFLG1.CANRFLG_BITS._TSTAT0   
#define TSTAT1_0 CAN0RFLG1.CANRFLG_BITS._TSTAT1     
#define RSTAT0_0 CAN0RFLG1.CANRFLG_BITS._RSTAT0     
#define RSTAT1_0 CAN0RFLG1.CANRFLG_BITS._RSTAT1 
#define CSCIF_0  CAN0RFLG1.CANRFLG_BITS._CSCIF 
#define WUPIF_0  CAN0RFLG1.CANRFLG_BITS._WUPIF

/*******************************************************************************************/
/*                      MSCAN12 RECEIVER INTERRUPT ENABLE REGISTER                         */
/*******************************************************************************************/
 volatile  CANRIER_TYPE CAN0RIER1 _IO_AT(0x145);               

/*DEFINE REGISTER*/                          
#define CAN0RIER CAN0RIER1.CANRIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFXIE_0   CAN0RIER1.CANRIER_BITS._RFXIE
#define OVRIE_0   CAN0RIER1.CANRIER_BITS._OVRIE  
#define TSTATE0_0 CAN0RIER1.CANRIER_BITS._TSTATE0   
#define TSTATE1_0 CAN0RIER1.CANRIER_BITS._TSTATE1     
#define RSTATE0_0 CAN0RIER1.CANRIER_BITS._RSTATE0     
#define RSTATE1_0 CAN0RIER1.CANRIER_BITS._RSTATE1 
#define CSCIE_0   CAN0RIER1.CANRIER_BITS._CSCIE 
#define WUPIE_0   CAN0RIER1.CANRIER_BITS._WUPIE

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER FLAG REGISTER                              */
/*******************************************************************************************/
 volatile  CANTFLG_TYPE CAN0TFLG1 _IO_AT(0x146);               

/*DEFINE REGISTER*/                          
#define CAN0TFLG CAN0TFLG1.CANTFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXE0_0 CAN0TFLG1.CANTFLG_BITS._TXE0
#define TXE1_0 CAN0TFLG1.CANTFLG_BITS._TXE1
#define TXE2_0 CAN0TFLG1.CANTFLG_BITS._TXE2

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER CONTROL REGISTER                           */
/*******************************************************************************************/
 volatile  CANTIER_TYPE CAN0TIER1 _IO_AT(0x147);               

/*DEFINE REGISTER*/                          
#define CAN0TIER CAN0TIER1.CANTIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXEIE0_0 CAN0TIER1.CANTIER_BITS._TXEIE0
#define TXEIE1_0 CAN0TIER1.CANTIER_BITS._TXEIE1
#define TXEIE2_0 CAN0TIER1.CANTIER_BITS._TXEIE2

/*******************************************************************************************/
/*                          MSCAN12 IDENTIFIER ACCEPTANCE CONTROL REGISTER                 */
/*******************************************************************************************/
 volatile  CANTARQ_TYPE CAN0TARQ1 _IO_AT(0x148);               

/*DEFINE REGISTER*/                          
#define CAN0TARQ CAN0TARQ1.CANTARQ_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTRQ0_0 CAN0TARQ1.CANTARQ_BITS._ABTRQ0
#define ABTRQ1_0 CAN0TARQ1.CANTARQ_BITS._ABTRQ1
#define ABTRQ2_0 CAN0TARQ1.CANTARQ_BITS._ABTRQ2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTAAK_TYPE CAN0TAAK1 _IO_AT(0x149);               

/*DEFINE REGISTER*/                          
#define CAN0TAAK CAN0TAAK1.CANTAAK_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTAK0_0 CAN0TAAK1.CANTAAK_BITS._ABTAK0
#define ABTAK1_0 CAN0TAAK1.CANTAAK_BITS._ABTAK1
#define ABTAK2_0 CAN0TAAK1.CANTAAK_BITS._ABTAK2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTBSEL_TYPE CAN0TBSEL1 _IO_AT(0x14A);               

/*DEFINE REGISTER*/                          
#define CAN0TBSEL CAN0TBSEL1.CANTBSEL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TX0_0 CAN0TBSEL1.CANTBSEL_BITS._TX0
#define TX1_0 CAN0TBSEL1.CANTBSEL_BITS._TX1
#define TX2_0 CAN0TBSEL1.CANTBSEL_BITS._TX2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANIDAC_TYPE CAN0IDAC1 _IO_AT(0x14B);               

/*DEFINE REGISTER*/                          
#define CAN0IDAC CAN0IDAC1.CANIDAC_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IDHI0_0  CAN0IDAC1.CANIDAC_BITS._IDHI0
#define IDHI1_0  CAN0IDAC1.CANIDAC_BITS._IDHI1
#define IDJIT2_0 CAN0IDAC1.CANIDAC_BITS._IDJIT2
#define IDAM0_0  CAN0IDAC1.CANIDAC_BITS._IDAM0
#define IDAM1_0  CAN0IDAC1.CANIDAC_BITS._IDAM1

