SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                      MSCAN12 RECEIVE ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN0RXERR    _IO_AT(0x14E); 

/**************************************************************************************************/
/*                                     MSCAN12 TRANSMIT ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN0TXERR    _IO_AT(0x14F); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN0IDAR0    _IO_AT(0x150); 
 volatile  unsigned char  CAN0IDAR1    _IO_AT(0x151); 
 volatile  unsigned char  CAN0IDAR2    _IO_AT(0x152); 
 volatile  unsigned char  CAN0IDAR3    _IO_AT(0x153); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN0IDMR0    _IO_AT(0x154); 
 volatile  unsigned char  CAN0IDMR1    _IO_AT(0x155); 
 volatile  unsigned char  CAN0IDMR2    _IO_AT(0x156); 
 volatile  unsigned char  CAN0IDMR3    _IO_AT(0x157); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN0IDAR4    _IO_AT(0x158); 
 volatile  unsigned char  CAN0IDAR5    _IO_AT(0x159); 
 volatile  unsigned char  CAN0IDAR6    _IO_AT(0x15A); 
 volatile  unsigned char  CAN0IDAR7    _IO_AT(0x15B); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN0IDMR4    _IO_AT(0x15C); 
 volatile  unsigned char  CAN0IDMR5    _IO_AT(0x15D); 
 volatile  unsigned char  CAN0IDMR6    _IO_AT(0x15E); 
 volatile  unsigned char  CAN0IDMR7    _IO_AT(0x15F); 

/**************************************************************************************************/
/*                                  FOREGROUND RECEIVE BUFFER                                     */
/**************************************************************************************************/
 volatile  unsigned char  CAN0RXFG[16]    _IO_AT(0x160); 

/**************************************************************************************************/
/*                                  FOREGROUND TRANSMIT BUFFER                                    */
/**************************************************************************************************/
 volatile  unsigned char  CAN0TXFG[16]    _IO_AT(0x170); 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 0                           */                                
/*******************************************************************************************/
 volatile  CANCTL0_TYPE CAN1CTL01 _IO_AT(0x180);               

/*DEFINE REGISTER*/                          
#define CAN1CTL0 CAN1CTL01.CANCTL0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITRQ_1 CAN1CTL01.CANCTL0_BITS._INITRQ       
#define SLPRQ_1  CAN1CTL01.CANCTL0_BITS._SLPRQ
#define WUPE_1   CAN1CTL01.CANCTL0_BITS._WUPE 
#define TIME_1   CAN1CTL01.CANCTL0_BITS._TIME       
#define SYNCH_1  CAN1CTL01.CANCTL0_BITS._SYNCH 
#define CSWAI_1  CAN1CTL01.CANCTL0_BITS._CSWAI 
#define RXACT_1  CAN1CTL01.CANCTL0_BITS._RXACT 
#define RXFRM_1  CAN1CTL01.CANCTL0_BITS._RXFRM 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 1                           */
/*******************************************************************************************/
 volatile  CANCTL1_TYPE CAN1CTL11 _IO_AT(0x181);               

/*DEFINE REGISTER*/                          
#define CAN1CTL1 CAN1CTL11.CANCTL1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITAK_1 CAN1CTL11.CANCTL1_BITS._INITAK      
#define SPLACK_1 CAN1CTL11.CANCTL1_BITS._SPLACK      
#define WUPM_1   CAN1CTL11.CANCTL1_BITS._WUPM
#define LISTEN_1 CAN1CTL11.CANCTL1_BITS._LISTEN      
#define LOOPB_1  CAN1CTL11.CANCTL1_BITS._LOOPB
#define CLKSRC_1 CAN1CTL11.CANCTL1_BITS._CLKSRC      
#define CANE_1   CAN1CTL11.CANCTL1_BITS._CANE      

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 0                             */
/*******************************************************************************************/
 volatile  CANBTR0_TYPE CAN1BTR01 _IO_AT(0x182);               

/*DEFINE REGISTER*/                          
#define CAN1BTR0 CAN1BTR01.CANCBTR0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BRP0_1 CAN1BTR01.CANBTR0_BITS._BRP0      
#define BRP1_1 CAN1BTR01.CANBTR0_BITS._BRP1      
#define BRP2_1 CAN1BTR01.CANBTR0_BITS._BRP2      
#define BRP3_1 CAN1BTR01.CANBTR0_BITS._BRP3      
#define BRP4_1 CAN1BTR01.CANBTR0_BITS._BRP4      
#define BRP5_1 CAN1BTR01.CANBTR0_BITS._BRP5      
#define SJW0_1 CAN1BTR01.CANBTR0_BITS._SJW0      
#define SJW1_1 CAN1BTR01.CANBTR0_BITS._SJW1

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 1                             */
/*******************************************************************************************/
 volatile  CANBTR1_TYPE CAN1BTR11 _IO_AT(0x183);               

/*DEFINE REGISTER*/                          
#define CAN1BTR1 CAN1BTR11.CANBTR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TSEG10_1 CAN1BTR11.CANBTR1_BITS._TSEG10    
#define TSEG11_1 CAN1BTR11.CANBTR1_BITS._TSEG11    
#define TSEG12_1 CAN1BTR11.CANBTR1_BITS._TSEG12    
#define TSEG13_1 CAN1BTR11.CANBTR1_BITS._TSEG13    
#define TSEG20_1 CAN1BTR11.CANBTR1_BITS._TSEG20    
#define TSEG21_1 CAN1BTR11.CANBTR1_BITS._TSEG21    
#define TSEG22_1 CAN1BTR11.CANBTR1_BITS._TSEG22    
#define SAMP_1   CAN1BTR11.CANBTR1_BITS._SAMP

/*******************************************************************************************/
/*                               MSCAN12 RECEIVER FLAG REGISTER                            */
/*******************************************************************************************/
 volatile  CANRFLG_TYPE CAN1RFLG1 _IO_AT(0x184);               

/*DEFINE REGISTER*/                          
#define CAN1RFLG CAN1RFLG1.CANRFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFX_1    CAN1RFLG1.CANRFLG_BITS._RFX
#define OVRIF_1  CAN1RFLG1.CANRFLG_BITS._OVRIF  
#define TSTAT0_1 CAN1RFLG1.CANRFLG_BITS._TSTAT0   
#define TSTAT1_1 CAN1RFLG1.CANRFLG_BITS._TSTAT1     
#define RSTAT0_1 CAN1RFLG1.CANRFLG_BITS._RSTAT0     
#define RSTAT1_1 CAN1RFLG1.CANRFLG_BITS._RSTAT1 
#define CSCIF_1  CAN1RFLG1.CANRFLG_BITS._CSCIF 
#define WUPIF_1  CAN1RFLG1.CANRFLG_BITS._WUPIF

/*******************************************************************************************/
/*                      MSCAN12 RECEIVER INTERRUPT ENABLE REGISTER                         */
/*******************************************************************************************/
 volatile  CANRIER_TYPE CAN1RIER1 _IO_AT(0x185);               

/*DEFINE REGISTER*/                          
#define CAN1RIER CAN1RIER1.CANRIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFXIE_1   CAN1RIER1.CANRIER_BITS._RFXIE
#define OVRIE_1   CAN1RIER1.CANRIER_BITS._OVRIE  
#define TSTATE0_1 CAN1RIER1.CANRIER_BITS._TSTATE0   
#define TSTATE1_1 CAN1RIER1.CANRIER_BITS._TSTATE1     
#define RSTATE0_1 CAN1RIER1.CANRIER_BITS._RSTATE0     
#define RSTATE1_1 CAN1RIER1.CANRIER_BITS._RSTATE1 
#define CSCIE_1   CAN1RIER1.CANRIER_BITS._CSCIE 
#define WUPIE_1   CAN1RIER1.CANRIER_BITS._WUPIE

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER FLAG REGISTER                              */
/*******************************************************************************************/
 volatile  CANTFLG_TYPE CAN1TFLG1 _IO_AT(0x186);               

/*DEFINE REGISTER*/                          
#define CAN1TFLG CAN1TFLG1.CANTFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXE0_1 CAN1TFLG1.CANTFLG_BITS._TXE0
#define TXE1_1 CAN1TFLG1.CANTFLG_BITS._TXE1
#define TXE2_1 CAN1TFLG1.CANTFLG_BITS._TXE2

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER CONTROL REGISTER                           */
/*******************************************************************************************/
 volatile  CANTIER_TYPE CAN1TIER1 _IO_AT(0x187);               

/*DEFINE REGISTER*/                          
#define CAN1TIER CAN1TIER1.CANTIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXEIE0_1 CAN1TIER1.CANTIER_BITS._TXEIE0
#define TXEIE1_1 CAN1TIER1.CANTIER_BITS._TXEIE1
#define TXEIE2_1 CAN1TIER1.CANTIER_BITS._TXEIE2

/*******************************************************************************************/
/*                          MSCAN12 IDENTIFIER ACCEPTANCE CONTROL REGISTER                 */
/*******************************************************************************************/
 volatile  CANTARQ_TYPE CAN1TARQ1 _IO_AT(0x188);               

/*DEFINE REGISTER*/                          
#define CAN1TARQ CAN1TARQ1.CANTARQ_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTRQ0_1 CAN1TARQ1.CANTARQ_BITS._ABTRQ0
#define ABTRQ1_1 CAN1TARQ1.CANTARQ_BITS._ABTRQ1
#define ABTRQ2_1 CAN1TARQ1.CANTARQ_BITS._ABTRQ2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTAAK_TYPE CAN1TAAK1 _IO_AT(0x189);               

/*DEFINE REGISTER*/                          
#define CAN1TAAK CAN1TAAK1.CANTAAK_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTAK0_1 CAN1TAAK1.CANTAAK_BITS._ABTAK0
#define ABTAK1_1 CAN1TAAK1.CANTAAK_BITS._ABTAK1
#define ABTAK2_1 CAN1TAAK1.CANTAAK_BITS._ABTAK2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTBSEL_TYPE CAN1TBSEL1 _IO_AT(0x18A);               

/*DEFINE REGISTER*/                          
#define CAN1TBSEL CAN1TBSEL1.CANTBSEL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TX0_1 CAN1TBSEL1.CANTBSEL_BITS._TX0
#define TX1_1 CAN1TBSEL1.CANTBSEL_BITS._TX1
#define TX2_1 CAN1TBSEL1.CANTBSEL_BITS._TX2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANIDAC_TYPE CAN1IDAC1 _IO_AT(0x18B);               

/*DEFINE REGISTER*/                          
#define CAN1IDAC CAN1IDAC1.CANIDAC_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IDHI0_1  CAN1IDAC1.CANIDAC_BITS._IDHI0
#define IDHI1_1  CAN1IDAC1.CANIDAC_BITS._IDHI1
#define IDJIT2_1 CAN1IDAC1.CANIDAC_BITS._IDJIT2
#define IDAM0_1  CAN1IDAC1.CANIDAC_BITS._IDAM0
#define IDAM1_1  CAN1IDAC1.CANIDAC_BITS._IDAM1

