SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                      MSCAN12 RECEIVE ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN1RXERR    _IO_AT(0x18E); 

/**************************************************************************************************/
/*                                     MSCAN12 TRANSMIT ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN1TXERR    _IO_AT(0x18F); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN1IDAR0    _IO_AT(0x190); 
 volatile  unsigned char  CAN1IDAR1    _IO_AT(0x191); 
 volatile  unsigned char  CAN1IDAR2    _IO_AT(0x192); 
 volatile  unsigned char  CAN1IDAR3    _IO_AT(0x193); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN1IDMR0    _IO_AT(0x194); 
 volatile  unsigned char  CAN1IDMR1    _IO_AT(0x195); 
 volatile  unsigned char  CAN1IDMR2    _IO_AT(0x196); 
 volatile  unsigned char  CAN1IDMR3    _IO_AT(0x197); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN1IDAR4    _IO_AT(0x198); 
 volatile  unsigned char  CAN1IDAR5    _IO_AT(0x199); 
 volatile  unsigned char  CAN1IDAR6    _IO_AT(0x19A); 
 volatile  unsigned char  CAN1IDAR7    _IO_AT(0x19B); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN1IDMR4    _IO_AT(0x19C); 
 volatile  unsigned char  CAN1IDMR5    _IO_AT(0x19D); 
 volatile  unsigned char  CAN1IDMR6    _IO_AT(0x19E); 
 volatile  unsigned char  CAN1IDMR7    _IO_AT(0x19F); 

/**************************************************************************************************/
/*                                  FOREGROUND RECEIVE BUFFER                                     */
/**************************************************************************************************/
 volatile  unsigned char  CAN1RXFG[16]    _IO_AT(0x1A0); 

/**************************************************************************************************/
/*                                  FOREGROUND TRANSMIT BUFFER                                    */
/**************************************************************************************************/
 volatile  unsigned char  CAN1TXFG[16]    _IO_AT(0x1B0); 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 0                           */                                
/*******************************************************************************************/
 volatile  CANCTL0_TYPE CAN2CTL01 _IO_AT(0x1C0);               

/*DEFINE REGISTER*/                          
#define CAN2CTL0 CAN2CTL01.CANCTL0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITRQ_2 CAN2CTL01.CANCTL0_BITS._INITRQ       
#define SLPRQ_2  CAN2CTL01.CANCTL0_BITS._SLPRQ
#define WUPE_2   CAN2CTL01.CANCTL0_BITS._WUPE 
#define TIME_2   CAN2CTL01.CANCTL0_BITS._TIME       
#define SYNCH_2  CAN2CTL01.CANCTL0_BITS._SYNCH 
#define CSWAI_2  CAN2CTL01.CANCTL0_BITS._CSWAI 
#define RXACT_2  CAN2CTL01.CANCTL0_BITS._RXACT 
#define RXFRM_2  CAN2CTL01.CANCTL0_BITS._RXFRM 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 1                           */
/*******************************************************************************************/
 volatile  CANCTL1_TYPE CAN2CTL11 _IO_AT(0x1C1);               

/*DEFINE REGISTER*/                          
#define CAN2CTL1 CAN2CTL11.CANCTL1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITAK_2 CAN2CTL11.CANCTL1_BITS._INITAK      
#define SPLACK_2 CAN2CTL11.CANCTL1_BITS._SPLACK      
#define WUPM_2   CAN2CTL11.CANCTL1_BITS._WUPM
#define LISTEN_2 CAN2CTL11.CANCTL1_BITS._LISTEN      
#define LOOPB_2  CAN2CTL11.CANCTL1_BITS._LOOPB
#define CLKSRC_2 CAN2CTL11.CANCTL1_BITS._CLKSRC      
#define CANE_2   CAN2CTL11.CANCTL1_BITS._CANE      

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 0                             */
/*******************************************************************************************/
 volatile  CANBTR0_TYPE CAN2BTR01 _IO_AT(0x1C2);               

/*DEFINE REGISTER*/                          
#define CAN2BTR0 CAN2BTR01.CANCBTR0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BRP0_2 CAN2BTR01.CANBTR0_BITS._BRP0      
#define BRP1_2 CAN2BTR01.CANBTR0_BITS._BRP1      
#define BRP2_2 CAN2BTR01.CANBTR0_BITS._BRP2      
#define BRP3_2 CAN2BTR01.CANBTR0_BITS._BRP3      
#define BRP4_2 CAN2BTR01.CANBTR0_BITS._BRP4      
#define BRP5_2 CAN2BTR01.CANBTR0_BITS._BRP5      
#define SJW0_2 CAN2BTR01.CANBTR0_BITS._SJW0      
#define SJW1_2 CAN2BTR01.CANBTR0_BITS._SJW1

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 1                             */
/*******************************************************************************************/
 volatile  CANBTR1_TYPE CAN2BTR11 _IO_AT(0x1C3);               

/*DEFINE REGISTER*/                          
#define CAN2BTR1 CAN2BTR11.CANBTR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TSEG10_2 CAN2BTR11.CANBTR1_BITS._TSEG10    
#define TSEG11_2 CAN2BTR11.CANBTR1_BITS._TSEG11    
#define TSEG12_2 CAN2BTR11.CANBTR1_BITS._TSEG12    
#define TSEG13_2 CAN2BTR11.CANBTR1_BITS._TSEG13    
#define TSEG20_2 CAN2BTR11.CANBTR1_BITS._TSEG20    
#define TSEG21_2 CAN2BTR11.CANBTR1_BITS._TSEG21    
#define TSEG22_2 CAN2BTR11.CANBTR1_BITS._TSEG22    
#define SAMP_2   CAN2BTR11.CANBTR1_BITS._SAMP

/*******************************************************************************************/
/*                               MSCAN12 RECEIVER FLAG REGISTER                            */
/*******************************************************************************************/
 volatile  CANRFLG_TYPE CAN2RFLG1 _IO_AT(0x1C4);               

/*DEFINE REGISTER*/                          
#define CAN2RFLG CAN2RFLG1.CANRFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFX_2    CAN2RFLG1.CANRFLG_BITS._RFX
#define OVRIF_2  CAN2RFLG1.CANRFLG_BITS._OVRIF  
#define TSTAT0_2 CAN2RFLG1.CANRFLG_BITS._TSTAT0   
#define TSTAT1_2 CAN2RFLG1.CANRFLG_BITS._TSTAT1     
#define RSTAT0_2 CAN2RFLG1.CANRFLG_BITS._RSTAT0     
#define RSTAT1_2 CAN2RFLG1.CANRFLG_BITS._RSTAT1 
#define CSCIF_2  CAN2RFLG1.CANRFLG_BITS._CSCIF 
#define WUPIF_2  CAN2RFLG1.CANRFLG_BITS._WUPIF

/*******************************************************************************************/
/*                      MSCAN12 RECEIVER INTERRUPT ENABLE REGISTER                         */
/*******************************************************************************************/
 volatile  CANRIER_TYPE CAN2RIER1 _IO_AT(0x1C5);               

/*DEFINE REGISTER*/                          
#define CAN2RIER CAN2RIER1.CANRIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFXIE_2   CAN2RIER1.CANRIER_BITS._RFXIE
#define OVRIE_2   CAN2RIER1.CANRIER_BITS._OVRIE  
#define TSTATE0_2 CAN2RIER1.CANRIER_BITS._TSTATE0   
#define TSTATE1_2 CAN2RIER1.CANRIER_BITS._TSTATE1     
#define RSTATE0_2 CAN2RIER1.CANRIER_BITS._RSTATE0     
#define RSTATE1_2 CAN2RIER1.CANRIER_BITS._RSTATE1 
#define CSCIE_2   CAN2RIER1.CANRIER_BITS._CSCIE 
#define WUPIE_2   CAN2RIER1.CANRIER_BITS._WUPIE

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER FLAG REGISTER                              */
/*******************************************************************************************/
 volatile  CANTFLG_TYPE CAN2TFLG1 _IO_AT(0x1C6);               

/*DEFINE REGISTER*/                          
#define CAN2TFLG CAN2TFLG1.CANTFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXE0_2 CAN2TFLG1.CANTFLG_BITS._TXE0
#define TXE1_2 CAN2TFLG1.CANTFLG_BITS._TXE1
#define TXE2_2 CAN2TFLG1.CANTFLG_BITS._TXE2

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER CONTROL REGISTER                           */
/*******************************************************************************************/
 volatile  CANTIER_TYPE CAN2TIER1 _IO_AT(0x1C7);               

/*DEFINE REGISTER*/                          
#define CAN2TIER CAN2TIER1.CANTIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXEIE0_2 CAN2TIER1.CANTIER_BITS._TXEIE0
#define TXEIE1_2 CAN2TIER1.CANTIER_BITS._TXEIE1
#define TXEIE2_2 CAN2TIER1.CANTIER_BITS._TXEIE2

/*******************************************************************************************/
/*                          MSCAN12 IDENTIFIER ACCEPTANCE CONTROL REGISTER                 */
/*******************************************************************************************/
 volatile  CANTARQ_TYPE CAN2TARQ1 _IO_AT(0x1C8);               

/*DEFINE REGISTER*/                          
#define CAN2TARQ CAN2TARQ1.CANTARQ_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTRQ0_2 CAN2TARQ1.CANTARQ_BITS._ABTRQ0
#define ABTRQ1_2 CAN2TARQ1.CANTARQ_BITS._ABTRQ1
#define ABTRQ2_2 CAN2TARQ1.CANTARQ_BITS._ABTRQ2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTAAK_TYPE CAN2TAAK1 _IO_AT(0x1C9);               

/*DEFINE REGISTER*/                          
#define CAN2TAAK CAN2TAAK1.CANTAAK_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTAK0_2 CAN2TAAK1.CANTAAK_BITS._ABTAK0
#define ABTAK1_2 CAN2TAAK1.CANTAAK_BITS._ABTAK1
#define ABTAK2_2 CAN2TAAK1.CANTAAK_BITS._ABTAK2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTBSEL_TYPE CAN2TBSEL1 _IO_AT(0x1CA);               

/*DEFINE REGISTER*/                          
#define CAN2TBSEL CAN2TBSEL1.CANTBSEL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TX0_2 CAN2TBSEL1.CANTBSEL_BITS._TX0
#define TX1_2 CAN2TBSEL1.CANTBSEL_BITS._TX1
#define TX2_2 CAN2TBSEL1.CANTBSEL_BITS._TX2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANIDAC_TYPE CAN2IDAC1 _IO_AT(0x1CB);               

/*DEFINE REGISTER*/                          
#define CAN2IDAC CAN2IDAC1.CANIDAC_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IDHI0_2  CAN2IDAC1.CANIDAC_BITS._IDHI0
#define IDHI1_2  CAN2IDAC1.CANIDAC_BITS._IDHI1
#define IDJIT2_2 CAN2IDAC1.CANIDAC_BITS._IDJIT2
#define IDAM0_2  CAN2IDAC1.CANIDAC_BITS._IDAM0
#define IDAM1_2  CAN2IDAC1.CANIDAC_BITS._IDAM1

