SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                      MSCAN12 RECEIVE ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN2RXERR    _IO_AT(0x1CE); 

/**************************************************************************************************/
/*                                     MSCAN12 TRANSMIT ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN2TXERR    _IO_AT(0x1CF); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN2IDAR0    _IO_AT(0x1D0); 
 volatile  unsigned char  CAN2IDAR1    _IO_AT(0x1D1); 
 volatile  unsigned char  CAN2IDAR2    _IO_AT(0x1D2); 
 volatile  unsigned char  CAN2IDAR3    _IO_AT(0x1D3); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN2IDMR0    _IO_AT(0x1D4); 
 volatile  unsigned char  CAN2IDMR1    _IO_AT(0x1D5); 
 volatile  unsigned char  CAN2IDMR2    _IO_AT(0x1D6); 
 volatile  unsigned char  CAN2IDMR3    _IO_AT(0x1D7); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN2IDAR4    _IO_AT(0x1D8); 
 volatile  unsigned char  CAN2IDAR5    _IO_AT(0x1D9); 
 volatile  unsigned char  CAN2IDAR6    _IO_AT(0x1DA); 
 volatile  unsigned char  CAN2IDAR7    _IO_AT(0x1DB); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN2IDMR4    _IO_AT(0x1DC); 
 volatile  unsigned char  CAN2IDMR5    _IO_AT(0x1DD); 
 volatile  unsigned char  CAN2IDMR6    _IO_AT(0x1DE); 
 volatile  unsigned char  CAN2IDMR7    _IO_AT(0x1DF); 

/**************************************************************************************************/
/*                                  FOREGROUND RECEIVE BUFFER                                     */
/**************************************************************************************************/
 volatile  unsigned char  CAN2RXFG[16]    _IO_AT(0x1E0); 

/**************************************************************************************************/
/*                                  FOREGROUND TRANSMIT BUFFER                                    */
/**************************************************************************************************/
 volatile  unsigned char  CAN2TXFG[16]    _IO_AT(0x1F0); 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 0                           */                                
/*******************************************************************************************/
 volatile  CANCTL0_TYPE CAN3CTL01 _IO_AT(0x200);               

/*DEFINE REGISTER*/                          
#define CAN3CTL0 CAN3CTL01.CANCTL0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITRQ_3 CAN3CTL01.CANCTL0_BITS._INITRQ       
#define SLPRQ_3  CAN3CTL01.CANCTL0_BITS._SLPRQ
#define WUPE_3   CAN3CTL01.CANCTL0_BITS._WUPE 
#define TIME_3   CAN3CTL01.CANCTL0_BITS._TIME       
#define SYNCH_3  CAN3CTL01.CANCTL0_BITS._SYNCH 
#define CSWAI_3  CAN3CTL01.CANCTL0_BITS._CSWAI 
#define RXACT_3  CAN3CTL01.CANCTL0_BITS._RXACT 
#define RXFRM_3  CAN3CTL01.CANCTL0_BITS._RXFRM 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 1                           */
/*******************************************************************************************/
 volatile  CANCTL1_TYPE CAN3CTL11 _IO_AT(0x201);               

/*DEFINE REGISTER*/                          
#define CAN3CTL1 CAN3CTL11.CANCTL1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITAK_3 CAN3CTL11.CANCTL1_BITS._INITAK      
#define SPLACK_3 CAN3CTL11.CANCTL1_BITS._SPLACK      
#define WUPM_3   CAN3CTL11.CANCTL1_BITS._WUPM
#define LISTEN_3 CAN3CTL11.CANCTL1_BITS._LISTEN      
#define LOOPB_3  CAN3CTL11.CANCTL1_BITS._LOOPB
#define CLKSRC_3 CAN3CTL11.CANCTL1_BITS._CLKSRC      
#define CANE_3   CAN3CTL11.CANCTL1_BITS._CANE      

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 0                             */
/*******************************************************************************************/
 volatile  CANBTR0_TYPE CAN3BTR01 _IO_AT(0x202);               

/*DEFINE REGISTER*/                          
#define CAN3BTR0 CAN3BTR01.CANCBTR0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BRP0_3 CAN3BTR01.CANBTR0_BITS._BRP0      
#define BRP1_3 CAN3BTR01.CANBTR0_BITS._BRP1      
#define BRP2_3 CAN3BTR01.CANBTR0_BITS._BRP2      
#define BRP3_3 CAN3BTR01.CANBTR0_BITS._BRP3      
#define BRP4_3 CAN3BTR01.CANBTR0_BITS._BRP4      
#define BRP5_3 CAN3BTR01.CANBTR0_BITS._BRP5      
#define SJW0_3 CAN3BTR01.CANBTR0_BITS._SJW0      
#define SJW1_3 CAN3BTR01.CANBTR0_BITS._SJW1

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 1                             */
/*******************************************************************************************/
 volatile  CANBTR1_TYPE CAN3BTR11 _IO_AT(0x203);               

/*DEFINE REGISTER*/                          
#define CAN3BTR1 CAN3BTR11.CANBTR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TSEG10_3 CAN3BTR11.CANBTR1_BITS._TSEG10    
#define TSEG11_3 CAN3BTR11.CANBTR1_BITS._TSEG11    
#define TSEG12_3 CAN3BTR11.CANBTR1_BITS._TSEG12    
#define TSEG13_3 CAN3BTR11.CANBTR1_BITS._TSEG13    
#define TSEG20_3 CAN3BTR11.CANBTR1_BITS._TSEG20    
#define TSEG21_3 CAN3BTR11.CANBTR1_BITS._TSEG21    
#define TSEG22_3 CAN3BTR11.CANBTR1_BITS._TSEG22    
#define SAMP_3   CAN3BTR11.CANBTR1_BITS._SAMP

/*******************************************************************************************/
/*                               MSCAN12 RECEIVER FLAG REGISTER                            */
/*******************************************************************************************/
 volatile  CANRFLG_TYPE CAN3RFLG1 _IO_AT(0x204);               

/*DEFINE REGISTER*/                          
#define CAN3RFLG CAN3RFLG1.CANRFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFX_3    CAN3RFLG1.CANRFLG_BITS._RFX
#define OVRIF_3  CAN3RFLG1.CANRFLG_BITS._OVRIF  
#define TSTAT0_3 CAN3RFLG1.CANRFLG_BITS._TSTAT0   
#define TSTAT1_3 CAN3RFLG1.CANRFLG_BITS._TSTAT1     
#define RSTAT0_3 CAN3RFLG1.CANRFLG_BITS._RSTAT0     
#define RSTAT1_3 CAN3RFLG1.CANRFLG_BITS._RSTAT1 
#define CSCIF_3  CAN3RFLG1.CANRFLG_BITS._CSCIF 
#define WUPIF_3  CAN3RFLG1.CANRFLG_BITS._WUPIF

/*******************************************************************************************/
/*                      MSCAN12 RECEIVER INTERRUPT ENABLE REGISTER                         */
/*******************************************************************************************/
 volatile  CANRIER_TYPE CAN3RIER1 _IO_AT(0x205);               

/*DEFINE REGISTER*/                          
#define CAN3RIER CAN3RIER1.CANRIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFXIE_3   CAN3RIER1.CANRIER_BITS._RFXIE
#define OVRIE_3   CAN3RIER1.CANRIER_BITS._OVRIE  
#define TSTATE0_3 CAN3RIER1.CANRIER_BITS._TSTATE0   
#define TSTATE1_3 CAN3RIER1.CANRIER_BITS._TSTATE1     
#define RSTATE0_3 CAN3RIER1.CANRIER_BITS._RSTATE0     
#define RSTATE1_3 CAN3RIER1.CANRIER_BITS._RSTATE1 
#define CSCIE_3   CAN3RIER1.CANRIER_BITS._CSCIE 
#define WUPIE_3   CAN3RIER1.CANRIER_BITS._WUPIE

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER FLAG REGISTER                              */
/*******************************************************************************************/
 volatile  CANTFLG_TYPE CAN3TFLG1 _IO_AT(0x206);               

/*DEFINE REGISTER*/                          
#define CAN3TFLG CAN3TFLG1.CANTFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXE0_3 CAN3TFLG1.CANTFLG_BITS._TXE0
#define TXE1_3 CAN3TFLG1.CANTFLG_BITS._TXE1
#define TXE2_3 CAN3TFLG1.CANTFLG_BITS._TXE2

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER CONTROL REGISTER                           */
/*******************************************************************************************/
 volatile  CANTIER_TYPE CAN3TIER1 _IO_AT(0x207);               

/*DEFINE REGISTER*/                          
#define CAN3TIER CAN3TIER1.CANTIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXEIE0_3 CAN3TIER1.CANTIER_BITS._TXEIE0
#define TXEIE1_3 CAN3TIER1.CANTIER_BITS._TXEIE1
#define TXEIE2_3 CAN3TIER1.CANTIER_BITS._TXEIE2

/*******************************************************************************************/
/*                          MSCAN12 IDENTIFIER ACCEPTANCE CONTROL REGISTER                 */
/*******************************************************************************************/
 volatile  CANTARQ_TYPE CAN3TARQ1 _IO_AT(0x208);               

/*DEFINE REGISTER*/                          
#define CAN3TARQ CAN3TARQ1.CANTARQ_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTRQ0_3 CAN3TARQ1.CANTARQ_BITS._ABTRQ0
#define ABTRQ1_3 CAN3TARQ1.CANTARQ_BITS._ABTRQ1
#define ABTRQ2_3 CAN3TARQ1.CANTARQ_BITS._ABTRQ2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTAAK_TYPE CAN3TAAK1 _IO_AT(0x209);               

/*DEFINE REGISTER*/                          
#define CAN3TAAK CAN3TAAK1.CANTAAK_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTAK0_3 CAN3TAAK1.CANTAAK_BITS._ABTAK0
#define ABTAK1_3 CAN3TAAK1.CANTAAK_BITS._ABTAK1
#define ABTAK2_3 CAN3TAAK1.CANTAAK_BITS._ABTAK2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTBSEL_TYPE CAN3TBSEL1 _IO_AT(0x20A);               

/*DEFINE REGISTER*/                          
#define CAN3TBSEL CAN3TBSEL1.CANTBSEL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TX0_3 CAN3TBSEL1.CANTBSEL_BITS._TX0
#define TX1_3 CAN3TBSEL1.CANTBSEL_BITS._TX1
#define TX2_3 CAN3TBSEL1.CANTBSEL_BITS._TX2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANIDAC_TYPE CAN3IDAC1 _IO_AT(0x20B);               

/*DEFINE REGISTER*/                          
#define CAN3IDAC CAN3IDAC1.CANIDAC_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IDHI0_3  CAN3IDAC1.CANIDAC_BITS._IDHI0
#define IDHI1_3  CAN3IDAC1.CANIDAC_BITS._IDHI1
#define IDJIT2_3 CAN3IDAC1.CANIDAC_BITS._IDJIT2
#define IDAM0_3  CAN3IDAC1.CANIDAC_BITS._IDAM0
#define IDAM1_3  CAN3IDAC1.CANIDAC_BITS._IDAM1

