SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                      MSCAN12 RECEIVE ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN3RXERR    _IO_AT(0x20E); 

/**************************************************************************************************/
/*                                     MSCAN12 TRANSMIT ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN3TXERR    _IO_AT(0x20F); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN3IDAR0    _IO_AT(0x210); 
 volatile  unsigned char  CAN3IDAR1    _IO_AT(0x211); 
 volatile  unsigned char  CAN3IDAR2    _IO_AT(0x212); 
 volatile  unsigned char  CAN3IDAR3    _IO_AT(0x213); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN3IDMR0    _IO_AT(0x214); 
 volatile  unsigned char  CAN3IDMR1    _IO_AT(0x215); 
 volatile  unsigned char  CAN3IDMR2    _IO_AT(0x216); 
 volatile  unsigned char  CAN3IDMR3    _IO_AT(0x217); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (Second bank)                       */
/**************************************************************************************************/

 volatile  unsigned char  CAN3IDAR4    _IO_AT(0x218); 
 volatile  unsigned char  CAN3IDAR5    _IO_AT(0x219); 
 volatile  unsigned char  CAN3IDAR6    _IO_AT(0x21A); 
 volatile  unsigned char  CAN3IDAR7    _IO_AT(0x21B); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN3IDMR4    _IO_AT(0x21C); 
 volatile  unsigned char  CAN3IDMR5    _IO_AT(0x21D); 
 volatile  unsigned char  CAN3IDMR6    _IO_AT(0x21E); 
 volatile  unsigned char  CAN3IDMR7    _IO_AT(0x21F); 

/**************************************************************************************************/
/*                                  FOREGROUND RECEIVE BUFFER                                     */
/**************************************************************************************************/
 volatile  unsigned char  CAN3RXFG[16]    _IO_AT(0x220); 

/**************************************************************************************************/
/*                                  FOREGROUND TRANSMIT BUFFER                                    */
/**************************************************************************************************/
 volatile  unsigned char  CAN3TXFG[16]    _IO_AT(0x230); 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 0                           */                                
/*******************************************************************************************/
 volatile  CANCTL0_TYPE CAN4CTL01 _IO_AT(0x280);               

/*DEFINE REGISTER*/                          
#define CAN4CTL0 CAN4CTL01.CANCTL0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITRQ_4 CAN4CTL01.CANCTL0_BITS._INITRQ       
#define SLPRQ_4  CAN4CTL01.CANCTL0_BITS._SLPRQ
#define WUPE_4   CAN4CTL01.CANCTL0_BITS._WUPE 
#define TIME_4   CAN4CTL01.CANCTL0_BITS._TIME       
#define SYNCH_4  CAN4CTL01.CANCTL0_BITS._SYNCH 
#define CSWAI_4  CAN4CTL01.CANCTL0_BITS._CSWAI 
#define RXACT_4  CAN4CTL01.CANCTL0_BITS._RXACT 
#define RXFRM_4  CAN4CTL01.CANCTL0_BITS._RXFRM 

/*******************************************************************************************/
/*                             MSCAN12 MODULE CONTROL REGISTER 1                           */
/*******************************************************************************************/
 volatile  CANCTL1_TYPE CAN4CTL11 _IO_AT(0x281);               

/*DEFINE REGISTER*/                          
#define CAN4CTL1 CAN4CTL11.CANCTL1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define INITAK_4 CAN4CTL11.CANCTL1_BITS._INITAK      
#define SPLACK_4 CAN4CTL11.CANCTL1_BITS._SPLACK      
#define WUPM_4   CAN4CTL11.CANCTL1_BITS._WUPM
#define LISTEN_4 CAN4CTL11.CANCTL1_BITS._LISTEN      
#define LOOPB_4  CAN4CTL11.CANCTL1_BITS._LOOPB
#define CLKSRC_4 CAN4CTL11.CANCTL1_BITS._CLKSRC      
#define CANE_4   CAN4CTL11.CANCTL1_BITS._CANE      

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 0                             */
/*******************************************************************************************/
 volatile  CANBTR0_TYPE CAN4BTR01 _IO_AT(0x282);               

/*DEFINE REGISTER*/                          
#define CAN4BTR0 CAN4BTR01.CANCBTR0_BYTE            

/*DEFINE REGISTER BITS*/                     
#define BRP0_4 CAN4BTR01.CANBTR0_BITS._BRP0      
#define BRP1_4 CAN4BTR01.CANBTR0_BITS._BRP1      
#define BRP2_4 CAN4BTR01.CANBTR0_BITS._BRP2      
#define BRP3_4 CAN4BTR01.CANBTR0_BITS._BRP3      
#define BRP4_4 CAN4BTR01.CANBTR0_BITS._BRP4      
#define BRP5_4 CAN4BTR01.CANBTR0_BITS._BRP5      
#define SJW0_4 CAN4BTR01.CANBTR0_BITS._SJW0      
#define SJW1_4 CAN4BTR01.CANBTR0_BITS._SJW1

/*******************************************************************************************/
/*                               MSCAN12 BUS TIMING REGISTER 1                             */
/*******************************************************************************************/
 volatile  CANBTR1_TYPE CAN4BTR11 _IO_AT(0x283);               

/*DEFINE REGISTER*/                          
#define CAN4BTR1 CAN4BTR11.CANBTR1_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TSEG10_4 CAN4BTR11.CANBTR1_BITS._TSEG10    
#define TSEG11_4 CAN4BTR11.CANBTR1_BITS._TSEG11    
#define TSEG12_4 CAN4BTR11.CANBTR1_BITS._TSEG12    
#define TSEG13_4 CAN4BTR11.CANBTR1_BITS._TSEG13    
#define TSEG20_4 CAN4BTR11.CANBTR1_BITS._TSEG20    
#define TSEG21_4 CAN4BTR11.CANBTR1_BITS._TSEG21    
#define TSEG22_4 CAN4BTR11.CANBTR1_BITS._TSEG22    
#define SAMP_4   CAN4BTR11.CANBTR1_BITS._SAMP

/*******************************************************************************************/
/*                               MSCAN12 RECEIVER FLAG REGISTER                            */
/*******************************************************************************************/
 volatile  CANRFLG_TYPE CAN4RFLG1 _IO_AT(0x284);               

/*DEFINE REGISTER*/                          
#define CAN4RFLG CAN4RFLG1.CANRFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFX_4    CAN4RFLG1.CANRFLG_BITS._RFX
#define OVRIF_4  CAN4RFLG1.CANRFLG_BITS._OVRIF  
#define TSTAT0_4 CAN4RFLG1.CANRFLG_BITS._TSTAT0   
#define TSTAT1_4 CAN4RFLG1.CANRFLG_BITS._TSTAT1     
#define RSTAT0_4 CAN4RFLG1.CANRFLG_BITS._RSTAT0     
#define RSTAT1_4 CAN4RFLG1.CANRFLG_BITS._RSTAT1 
#define CSCIF_4  CAN4RFLG1.CANRFLG_BITS._CSCIF 
#define WUPIF_4  CAN4RFLG1.CANRFLG_BITS._WUPIF

/*******************************************************************************************/
/*                      MSCAN12 RECEIVER INTERRUPT ENABLE REGISTER                         */
/*******************************************************************************************/
 volatile  CANRIER_TYPE CAN4RIER1 _IO_AT(0x285);               

/*DEFINE REGISTER*/                          
#define CAN4RIER CAN4RIER1.CANRIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define RFXIE_4   CAN4RIER1.CANRIER_BITS._RFXIE
#define OVRIE_4   CAN4RIER1.CANRIER_BITS._OVRIE  
#define TSTATE0_4 CAN4RIER1.CANRIER_BITS._TSTATE0   
#define TSTATE1_4 CAN4RIER1.CANRIER_BITS._TSTATE1     
#define RSTATE0_4 CAN4RIER1.CANRIER_BITS._RSTATE0     
#define RSTATE1_4 CAN4RIER1.CANRIER_BITS._RSTATE1 
#define CSCIE_4   CAN4RIER1.CANRIER_BITS._CSCIE 
#define WUPIE_4   CAN4RIER1.CANRIER_BITS._WUPIE

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER FLAG REGISTER                              */
/*******************************************************************************************/
 volatile  CANTFLG_TYPE CAN4TFLG1 _IO_AT(0x286);               

/*DEFINE REGISTER*/                          
#define CAN4TFLG CAN4TFLG1.CANTFLG_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXE0_4 CAN4TFLG1.CANTFLG_BITS._TXE0
#define TXE1_4 CAN4TFLG1.CANTFLG_BITS._TXE1
#define TXE2_4 CAN4TFLG1.CANTFLG_BITS._TXE2

/*******************************************************************************************/
/*                          MSCAN12 TRANSMITTER CONTROL REGISTER                           */
/*******************************************************************************************/
 volatile  CANTIER_TYPE CAN4TIER1 _IO_AT(0x287);               

/*DEFINE REGISTER*/                          
#define CAN4TIER CAN4TIER1.CANTIER_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TXEIE0_4 CAN4TIER1.CANTIER_BITS._TXEIE0
#define TXEIE1_4 CAN4TIER1.CANTIER_BITS._TXEIE1
#define TXEIE2_4 CAN4TIER1.CANTIER_BITS._TXEIE2

/*******************************************************************************************/
/*                          MSCAN12 IDENTIFIER ACCEPTANCE CONTROL REGISTER                 */
/*******************************************************************************************/
 volatile  CANTARQ_TYPE CAN4TARQ1 _IO_AT(0x288);               

/*DEFINE REGISTER*/                          
#define CAN4TARQ CAN4TARQ1.CANTARQ_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTRQ0_4 CAN4TARQ1.CANTARQ_BITS._ABTRQ0
#define ABTRQ1_4 CAN4TARQ1.CANTARQ_BITS._ABTRQ1
#define ABTRQ2_4 CAN4TARQ1.CANTARQ_BITS._ABTRQ2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTAAK_TYPE CAN4TAAK1 _IO_AT(0x289);               

/*DEFINE REGISTER*/                          
#define CAN4TAAK CAN4TAAK1.CANTAAK_BYTE            

/*DEFINE REGISTER BITS*/                     
#define ABTAK0_4 CAN4TAAK1.CANTAAK_BITS._ABTAK0
#define ABTAK1_4 CAN4TAAK1.CANTAAK_BITS._ABTAK1
#define ABTAK2_4 CAN4TAAK1.CANTAAK_BITS._ABTAK2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANTBSEL_TYPE CAN4TBSEL1 _IO_AT(0x28A);               

/*DEFINE REGISTER*/                          
#define CAN4TBSEL CAN4TBSEL1.CANTBSEL_BYTE            

/*DEFINE REGISTER BITS*/                     
#define TX0_4 CAN4TBSEL1.CANTBSEL_BITS._TX0
#define TX1_4 CAN4TBSEL1.CANTBSEL_BITS._TX1
#define TX2_4 CAN4TBSEL1.CANTBSEL_BITS._TX2

/*******************************************************************************************/
/*                                           */
/*******************************************************************************************/
 volatile  CANIDAC_TYPE CAN4IDAC1 _IO_AT(0x28B);               

/*DEFINE REGISTER*/                          
#define CAN4IDAC CAN4IDAC1.CANIDAC_BYTE            

/*DEFINE REGISTER BITS*/                     
#define IDHI0_4  CAN4IDAC1.CANIDAC_BITS._IDHI0
#define IDHI1_4  CAN4IDAC1.CANIDAC_BITS._IDHI1
#define IDJIT2_4 CAN4IDAC1.CANIDAC_BITS._IDJIT2
#define IDAM0_4  CAN4IDAC1.CANIDAC_BITS._IDAM0
#define IDAM1_4  CAN4IDAC1.CANIDAC_BITS._IDAM1

