SolaZhao/freescale/CWS12v5.2/(CodeWarrior_Examples)/HC12/Harald_Kreidl/Beispiel 4/sources/MC9S12DP256.h
/**************************************************************************************************/
/*                                      MSCAN12 RECEIVE ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN4RXERR    _IO_AT(0x28E); 

/**************************************************************************************************/
/*                                     MSCAN12 TRANSMIT ERROR COUNTER                             */
/**************************************************************************************************/
 volatile  unsigned char  CAN4TXERR    _IO_AT(0x28F); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN4IDAR0    _IO_AT(0x290); 
 volatile  unsigned char  CAN4IDAR1    _IO_AT(0x291); 
 volatile  unsigned char  CAN4IDAR2    _IO_AT(0x292); 
 volatile  unsigned char  CAN4IDAR3    _IO_AT(0x293); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (First bank)                        */
/**************************************************************************************************/
 volatile  unsigned char  CAN4IDMR0    _IO_AT(0x294); 
 volatile  unsigned char  CAN4IDMR1    _IO_AT(0x295); 
 volatile  unsigned char  CAN4IDMR2    _IO_AT(0x296); 
 volatile  unsigned char  CAN4IDMR3    _IO_AT(0x297); 

/**************************************************************************************************/
/*                            IDENTIFIER ACCEPTANCE REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN4IDAR4    _IO_AT(0x298); 
 volatile  unsigned char  CAN4IDAR5    _IO_AT(0x299); 
 volatile  unsigned char  CAN4IDAR6    _IO_AT(0x29A); 
 volatile  unsigned char  CAN4IDAR7    _IO_AT(0x29B); 

/**************************************************************************************************/
/*                                  IDENTIFIER MASK REGISTERS (Second bank)                       */
/**************************************************************************************************/
 volatile  unsigned char  CAN4IDMR4    _IO_AT(0x29C); 
 volatile  unsigned char  CAN4IDMR5    _IO_AT(0x29D); 
 volatile  unsigned char  CAN4IDMR6    _IO_AT(0x29E); 
 volatile  unsigned char  CAN4IDMR7    _IO_AT(0x29F); 

/**************************************************************************************************/
/*                                  FOREGROUND RECEIVE BUFFER                                     */
/**************************************************************************************************/
 volatile  unsigned char  CAN4RXFG[16]    _IO_AT(0x2A0); 

/**************************************************************************************************/
/*                                  FOREGROUND TRANSMIT BUFFER                                    */
/**************************************************************************************************/
 volatile  unsigned char  CAN4TXFG[16]    _IO_AT(0x2B0); 

/*******************************************************************************************/
/*                                           PORT T                                        */
/*******************************************************************************************/
 volatile  unsigned char PTT     _IO_AT(0x240);  
 volatile  unsigned char PTIT    _IO_AT(0x241);  
 volatile  unsigned char DDRT    _IO_AT(0x242);  
 volatile  unsigned char RDRT    _IO_AT(0x243);  
 volatile  unsigned char PERT    _IO_AT(0x244);  
 volatile  unsigned char PPST    _IO_AT(0x245);  

/*******************************************************************************************/
/*                                           PORT S                                        */
/*******************************************************************************************/
 volatile  unsigned char PTS     _IO_AT(0x248);  
 volatile  unsigned char PTIS    _IO_AT(0x249);  
 volatile  unsigned char DDRS    _IO_AT(0x24A);  
 volatile  unsigned char RDRS    _IO_AT(0x24B);  
 volatile  unsigned char PERS    _IO_AT(0x24C);  
 volatile  unsigned char PPSS    _IO_AT(0x24D);  
 volatile  unsigned char WOMS    _IO_AT(0x24E);  

/*******************************************************************************************/
/*                                           PORT M                                        */
/*******************************************************************************************/
 volatile  unsigned char PTM     _IO_AT(0x250);  
 volatile  unsigned char PTIM    _IO_AT(0x251);  
 volatile  unsigned char DDRM    _IO_AT(0x252);  
 volatile  unsigned char RDRM    _IO_AT(0x253);  
 volatile  unsigned char PERM    _IO_AT(0x254);  
 volatile  unsigned char PPSM    _IO_AT(0x255);  
 volatile  unsigned char WOMM    _IO_AT(0x256);  

/*******************************************************************************************/
/*                                           PORT P                                        */
/*******************************************************************************************/
 volatile  unsigned char PTP     _IO_AT(0x258);  
 volatile  unsigned char PTIP    _IO_AT(0x259);  
 volatile  unsigned char DDRP    _IO_AT(0x25A);  
 volatile  unsigned char RDRP    _IO_AT(0x25B);  
 volatile  unsigned char PERP    _IO_AT(0x25C);  
 volatile  unsigned char PPSP    _IO_AT(0x25D);  
 volatile  unsigned char PIEP    _IO_AT(0x25E);  
 volatile  unsigned char PIFP    _IO_AT(0x25F);  

/*******************************************************************************************/
/*                                           PORT H                                        */
/*******************************************************************************************/
 volatile  unsigned char PTH     _IO_AT(0x260);  
 volatile  unsigned char PTIH    _IO_AT(0x261);  
 volatile  unsigned char DDRH    _IO_AT(0x262);  
 volatile  unsigned char RDRH    _IO_AT(0x263);  
 volatile  unsigned char PERH    _IO_AT(0x264);  
 volatile  unsigned char PPSH    _IO_AT(0x265);  
 volatile  unsigned char PIEH    _IO_AT(0x266);  
 volatile  unsigned char PIFH    _IO_AT(0x267);  

/*******************************************************************************************/
/*                                           PORT J                                        */
/*******************************************************************************************/
 volatile  unsigned char PTJ     _IO_AT(0x268);  
 volatile  unsigned char PTIJ    _IO_AT(0x269);  
 volatile  unsigned char DDRJ    _IO_AT(0x26A);  
 volatile  unsigned char RDRJ    _IO_AT(0x26B);  
 volatile  unsigned char PERJ    _IO_AT(0x26C);  
 volatile  unsigned char PPSJ    _IO_AT(0x26D);  
 volatile  unsigned char PIEJ    _IO_AT(0x26E);  
 volatile  unsigned char PIFJ    _IO_AT(0x26F);  


#endif /* __6812DP256_H__ */
